garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f56q24.inc
// Register: DMASELECT
#define DMASELECT DMASELECT
DMASELECT                                equ 00E7h
// bitfield definitions
DMASELECT_SLCT_POSN                      equ 0000h
DMASELECT_SLCT_POSITION                  equ 0000h
DMASELECT_SLCT_SIZE                      equ 0008h
DMASELECT_SLCT_LENGTH                    equ 0008h
DMASELECT_SLCT_MASK                      equ 00FFh
DMASELECT_SLCT0_POSN                     equ 0000h
DMASELECT_SLCT0_POSITION                 equ 0000h
DMASELECT_SLCT0_SIZE                     equ 0001h
DMASELECT_SLCT0_LENGTH                   equ 0001h
DMASELECT_SLCT0_MASK                     equ 0001h
DMASELECT_SLCT1_POSN                     equ 0001h
DMASELECT_SLCT1_POSITION                 equ 0001h
DMASELECT_SLCT1_SIZE                     equ 0001h
DMASELECT_SLCT1_LENGTH                   equ 0001h
DMASELECT_SLCT1_MASK                     equ 0002h

// Register: DMAnBUF
#define DMAnBUF DMAnBUF
DMAnBUF                                  equ 00E8h
// bitfield definitions
DMAnBUF_BUF_POSN                         equ 0000h
DMAnBUF_BUF_POSITION                     equ 0000h
DMAnBUF_BUF_SIZE                         equ 0008h
DMAnBUF_BUF_LENGTH                       equ 0008h
DMAnBUF_BUF_MASK                         equ 00FFh
DMAnBUF_BUF0_POSN                        equ 0000h
DMAnBUF_BUF0_POSITION                    equ 0000h
DMAnBUF_BUF0_SIZE                        equ 0001h
DMAnBUF_BUF0_LENGTH                      equ 0001h
DMAnBUF_BUF0_MASK                        equ 0001h
DMAnBUF_BUF1_POSN                        equ 0001h
DMAnBUF_BUF1_POSITION                    equ 0001h
DMAnBUF_BUF1_SIZE                        equ 0001h
DMAnBUF_BUF1_LENGTH                      equ 0001h
DMAnBUF_BUF1_MASK                        equ 0002h
DMAnBUF_BUF2_POSN                        equ 0002h
DMAnBUF_BUF2_POSITION                    equ 0002h
DMAnBUF_BUF2_SIZE                        equ 0001h
DMAnBUF_BUF2_LENGTH                      equ 0001h
DMAnBUF_BUF2_MASK                        equ 0004h
DMAnBUF_BUF3_POSN                        equ 0003h
DMAnBUF_BUF3_POSITION                    equ 0003h
DMAnBUF_BUF3_SIZE                        equ 0001h
DMAnBUF_BUF3_LENGTH                      equ 0001h
DMAnBUF_BUF3_MASK                        equ 0008h
DMAnBUF_BUF4_POSN                        equ 0004h
DMAnBUF_BUF4_POSITION                    equ 0004h
DMAnBUF_BUF4_SIZE                        equ 0001h
DMAnBUF_BUF4_LENGTH                      equ 0001h
DMAnBUF_BUF4_MASK                        equ 0010h
DMAnBUF_BUF5_POSN                        equ 0005h
DMAnBUF_BUF5_POSITION                    equ 0005h
DMAnBUF_BUF5_SIZE                        equ 0001h
DMAnBUF_BUF5_LENGTH                      equ 0001h
DMAnBUF_BUF5_MASK                        equ 0020h
DMAnBUF_BUF6_POSN                        equ 0006h
DMAnBUF_BUF6_POSITION                    equ 0006h
DMAnBUF_BUF6_SIZE                        equ 0001h
DMAnBUF_BUF6_LENGTH                      equ 0001h
DMAnBUF_BUF6_MASK                        equ 0040h
DMAnBUF_BUF7_POSN                        equ 0007h
DMAnBUF_BUF7_POSITION                    equ 0007h
DMAnBUF_BUF7_SIZE                        equ 0001h
DMAnBUF_BUF7_LENGTH                      equ 0001h
DMAnBUF_BUF7_MASK                        equ 0080h

// Register: DMAnDCNT
#define DMAnDCNT DMAnDCNT
DMAnDCNT                                 equ 00E9h

// Register: DMAnDCNTL
#define DMAnDCNTL DMAnDCNTL
DMAnDCNTL                                equ 00E9h
// bitfield definitions
DMAnDCNTL_DCNT_POSN                      equ 0000h
DMAnDCNTL_DCNT_POSITION                  equ 0000h
DMAnDCNTL_DCNT_SIZE                      equ 0008h
DMAnDCNTL_DCNT_LENGTH                    equ 0008h
DMAnDCNTL_DCNT_MASK                      equ 00FFh
DMAnDCNTL_DCNT0_POSN                     equ 0000h
DMAnDCNTL_DCNT0_POSITION                 equ 0000h
DMAnDCNTL_DCNT0_SIZE                     equ 0001h
DMAnDCNTL_DCNT0_LENGTH                   equ 0001h
DMAnDCNTL_DCNT0_MASK                     equ 0001h
DMAnDCNTL_DCNT1_POSN                     equ 0001h
DMAnDCNTL_DCNT1_POSITION                 equ 0001h
DMAnDCNTL_DCNT1_SIZE                     equ 0001h
DMAnDCNTL_DCNT1_LENGTH                   equ 0001h
DMAnDCNTL_DCNT1_MASK                     equ 0002h
DMAnDCNTL_DCNT2_POSN                     equ 0002h
DMAnDCNTL_DCNT2_POSITION                 equ 0002h
DMAnDCNTL_DCNT2_SIZE                     equ 0001h
DMAnDCNTL_DCNT2_LENGTH                   equ 0001h
DMAnDCNTL_DCNT2_MASK                     equ 0004h
DMAnDCNTL_DCNT3_POSN                     equ 0003h
DMAnDCNTL_DCNT3_POSITION                 equ 0003h
DMAnDCNTL_DCNT3_SIZE                     equ 0001h
DMAnDCNTL_DCNT3_LENGTH                   equ 0001h
DMAnDCNTL_DCNT3_MASK                     equ 0008h
DMAnDCNTL_DCNT4_POSN                     equ 0004h
DMAnDCNTL_DCNT4_POSITION                 equ 0004h
DMAnDCNTL_DCNT4_SIZE                     equ 0001h
DMAnDCNTL_DCNT4_LENGTH                   equ 0001h
DMAnDCNTL_DCNT4_MASK                     equ 0010h
DMAnDCNTL_DCNT5_POSN                     equ 0005h
DMAnDCNTL_DCNT5_POSITION                 equ 0005h
DMAnDCNTL_DCNT5_SIZE                     equ 0001h
DMAnDCNTL_DCNT5_LENGTH                   equ 0001h
DMAnDCNTL_DCNT5_MASK                     equ 0020h
DMAnDCNTL_DCNT6_POSN                     equ 0006h
DMAnDCNTL_DCNT6_POSITION                 equ 0006h
DMAnDCNTL_DCNT6_SIZE                     equ 0001h
DMAnDCNTL_DCNT6_LENGTH                   equ 0001h
DMAnDCNTL_DCNT6_MASK                     equ 0040h
DMAnDCNTL_DCNT7_POSN                     equ 0007h
DMAnDCNTL_DCNT7_POSITION                 equ 0007h
DMAnDCNTL_DCNT7_SIZE                     equ 0001h
DMAnDCNTL_DCNT7_LENGTH                   equ 0001h
DMAnDCNTL_DCNT7_MASK                     equ 0080h

// Register: DMAnDCNTH
#define DMAnDCNTH DMAnDCNTH
DMAnDCNTH                                equ 00EAh
// bitfield definitions
DMAnDCNTH_DCNT_POSN                      equ 0000h
DMAnDCNTH_DCNT_POSITION                  equ 0000h
DMAnDCNTH_DCNT_SIZE                      equ 0008h
DMAnDCNTH_DCNT_LENGTH                    equ 0008h
DMAnDCNTH_DCNT_MASK                      equ 00FFh
DMAnDCNTH_DCNT8_POSN                     equ 0000h
DMAnDCNTH_DCNT8_POSITION                 equ 0000h
DMAnDCNTH_DCNT8_SIZE                     equ 0001h
DMAnDCNTH_DCNT8_LENGTH                   equ 0001h
DMAnDCNTH_DCNT8_MASK                     equ 0001h
DMAnDCNTH_DCNT9_POSN                     equ 0001h
DMAnDCNTH_DCNT9_POSITION                 equ 0001h
DMAnDCNTH_DCNT9_SIZE                     equ 0001h
DMAnDCNTH_DCNT9_LENGTH                   equ 0001h
DMAnDCNTH_DCNT9_MASK                     equ 0002h
DMAnDCNTH_DCNT10_POSN                    equ 0002h
DMAnDCNTH_DCNT10_POSITION                equ 0002h
DMAnDCNTH_DCNT10_SIZE                    equ 0001h
DMAnDCNTH_DCNT10_LENGTH                  equ 0001h
DMAnDCNTH_DCNT10_MASK                    equ 0004h
DMAnDCNTH_DCNT11_POSN                    equ 0003h
DMAnDCNTH_DCNT11_POSITION                equ 0003h
DMAnDCNTH_DCNT11_SIZE                    equ 0001h
DMAnDCNTH_DCNT11_LENGTH                  equ 0001h
DMAnDCNTH_DCNT11_MASK                    equ 0008h

// Register: DMAnDPTR
#define DMAnDPTR DMAnDPTR
DMAnDPTR                                 equ 00EBh

// Register: DMAnDPTRL
#define DMAnDPTRL DMAnDPTRL
DMAnDPTRL                                equ 00EBh
// bitfield definitions
DMAnDPTRL_DPTR_POSN                      equ 0000h
DMAnDPTRL_DPTR_POSITION                  equ 0000h
DMAnDPTRL_DPTR_SIZE                      equ 0008h
DMAnDPTRL_DPTR_LENGTH                    equ 0008h
DMAnDPTRL_DPTR_MASK                      equ 00FFh
DMAnDPTRL_DPTR0_POSN                     equ 0000h
DMAnDPTRL_DPTR0_POSITION                 equ 0000h
DMAnDPTRL_DPTR0_SIZE                     equ 0001h
DMAnDPTRL_DPTR0_LENGTH                   equ 0001h
DMAnDPTRL_DPTR0_MASK                     equ 0001h
DMAnDPTRL_DPTR1_POSN                     equ 0001h
DMAnDPTRL_DPTR1_POSITION                 equ 0001h
DMAnDPTRL_DPTR1_SIZE                     equ 0001h
DMAnDPTRL_DPTR1_LENGTH                   equ 0001h
DMAnDPTRL_DPTR1_MASK                     equ 0002h
DMAnDPTRL_DPTR2_POSN                     equ 0002h
DMAnDPTRL_DPTR2_POSITION                 equ 0002h
DMAnDPTRL_DPTR2_SIZE                     equ 0001h
DMAnDPTRL_DPTR2_LENGTH                   equ 0001h
DMAnDPTRL_DPTR2_MASK                     equ 0004h
DMAnDPTRL_DPTR3_POSN                     equ 0003h
DMAnDPTRL_DPTR3_POSITION                 equ 0003h
DMAnDPTRL_DPTR3_SIZE                     equ 0001h
DMAnDPTRL_DPTR3_LENGTH                   equ 0001h
DMAnDPTRL_DPTR3_MASK                     equ 0008h
DMAnDPTRL_DPTR4_POSN                     equ 0004h
DMAnDPTRL_DPTR4_POSITION                 equ 0004h
DMAnDPTRL_DPTR4_SIZE                     equ 0001h
DMAnDPTRL_DPTR4_LENGTH                   equ 0001h
DMAnDPTRL_DPTR4_MASK                     equ 0010h
DMAnDPTRL_DPTR5_POSN                     equ 0005h
DMAnDPTRL_DPTR5_POSITION                 equ 0005h
DMAnDPTRL_DPTR5_SIZE                     equ 0001h
DMAnDPTRL_DPTR5_LENGTH                   equ 0001h
DMAnDPTRL_DPTR5_MASK                     equ 0020h
DMAnDPTRL_DPTR6_POSN                     equ 0006h
DMAnDPTRL_DPTR6_POSITION                 equ 0006h
DMAnDPTRL_DPTR6_SIZE                     equ 0001h
DMAnDPTRL_DPTR6_LENGTH                   equ 0001h
DMAnDPTRL_DPTR6_MASK                     equ 0040h
DMAnDPTRL_DPTR7_POSN                     equ 0007h
DMAnDPTRL_DPTR7_POSITION                 equ 0007h
DMAnDPTRL_DPTR7_SIZE                     equ 0001h
DMAnDPTRL_DPTR7_LENGTH                   equ 0001h
DMAnDPTRL_DPTR7_MASK                     equ 0080h

