garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f56q24.inc
// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
T3CKIPPS                                 equ 0244h
// bitfield definitions
T3CKIPPS_PIN_POSN                        equ 0000h
T3CKIPPS_PIN_POSITION                    equ 0000h
T3CKIPPS_PIN_SIZE                        equ 0003h
T3CKIPPS_PIN_LENGTH                      equ 0003h
T3CKIPPS_PIN_MASK                        equ 0007h
T3CKIPPS_PORT_POSN                       equ 0003h
T3CKIPPS_PORT_POSITION                   equ 0003h
T3CKIPPS_PORT_SIZE                       equ 0003h
T3CKIPPS_PORT_LENGTH                     equ 0003h
T3CKIPPS_PORT_MASK                       equ 0038h
T3CKIPPS_T3CKIPPS0_POSN                  equ 0000h
T3CKIPPS_T3CKIPPS0_POSITION              equ 0000h
T3CKIPPS_T3CKIPPS0_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS0_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS0_MASK                  equ 0001h
T3CKIPPS_T3CKIPPS1_POSN                  equ 0001h
T3CKIPPS_T3CKIPPS1_POSITION              equ 0001h
T3CKIPPS_T3CKIPPS1_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS1_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS1_MASK                  equ 0002h
T3CKIPPS_T3CKIPPS2_POSN                  equ 0002h
T3CKIPPS_T3CKIPPS2_POSITION              equ 0002h
T3CKIPPS_T3CKIPPS2_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS2_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS2_MASK                  equ 0004h
T3CKIPPS_T3CKIPPS3_POSN                  equ 0003h
T3CKIPPS_T3CKIPPS3_POSITION              equ 0003h
T3CKIPPS_T3CKIPPS3_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS3_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS3_MASK                  equ 0008h
T3CKIPPS_T3CKIPPS4_POSN                  equ 0004h
T3CKIPPS_T3CKIPPS4_POSITION              equ 0004h
T3CKIPPS_T3CKIPPS4_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS4_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS4_MASK                  equ 0010h
T3CKIPPS_T3CKIPPS5_POSN                  equ 0005h
T3CKIPPS_T3CKIPPS5_POSITION              equ 0005h
T3CKIPPS_T3CKIPPS5_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS5_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS5_MASK                  equ 0020h
T3CKIPPS_T3CKIPPS_POSN                   equ 0000h
T3CKIPPS_T3CKIPPS_POSITION               equ 0000h
T3CKIPPS_T3CKIPPS_SIZE                   equ 0006h
T3CKIPPS_T3CKIPPS_LENGTH                 equ 0006h
T3CKIPPS_T3CKIPPS_MASK                   equ 003Fh

// Register: T3GPPS
#define T3GPPS T3GPPS
T3GPPS                                   equ 0245h
// bitfield definitions
T3GPPS_PIN_POSN                          equ 0000h
T3GPPS_PIN_POSITION                      equ 0000h
T3GPPS_PIN_SIZE                          equ 0003h
T3GPPS_PIN_LENGTH                        equ 0003h
T3GPPS_PIN_MASK                          equ 0007h
T3GPPS_PORT_POSN                         equ 0003h
T3GPPS_PORT_POSITION                     equ 0003h
T3GPPS_PORT_SIZE                         equ 0003h
T3GPPS_PORT_LENGTH                       equ 0003h
T3GPPS_PORT_MASK                         equ 0038h
T3GPPS_T3GPPS0_POSN                      equ 0000h
T3GPPS_T3GPPS0_POSITION                  equ 0000h
T3GPPS_T3GPPS0_SIZE                      equ 0001h
T3GPPS_T3GPPS0_LENGTH                    equ 0001h
T3GPPS_T3GPPS0_MASK                      equ 0001h
T3GPPS_T3GPPS1_POSN                      equ 0001h
T3GPPS_T3GPPS1_POSITION                  equ 0001h
T3GPPS_T3GPPS1_SIZE                      equ 0001h
T3GPPS_T3GPPS1_LENGTH                    equ 0001h
T3GPPS_T3GPPS1_MASK                      equ 0002h
T3GPPS_T3GPPS2_POSN                      equ 0002h
T3GPPS_T3GPPS2_POSITION                  equ 0002h
T3GPPS_T3GPPS2_SIZE                      equ 0001h
T3GPPS_T3GPPS2_LENGTH                    equ 0001h
T3GPPS_T3GPPS2_MASK                      equ 0004h
T3GPPS_T3GPPS3_POSN                      equ 0003h
T3GPPS_T3GPPS3_POSITION                  equ 0003h
T3GPPS_T3GPPS3_SIZE                      equ 0001h
T3GPPS_T3GPPS3_LENGTH                    equ 0001h
T3GPPS_T3GPPS3_MASK                      equ 0008h
T3GPPS_T3GPPS4_POSN                      equ 0004h
T3GPPS_T3GPPS4_POSITION                  equ 0004h
T3GPPS_T3GPPS4_SIZE                      equ 0001h
T3GPPS_T3GPPS4_LENGTH                    equ 0001h
T3GPPS_T3GPPS4_MASK                      equ 0010h
T3GPPS_T3GPPS5_POSN                      equ 0005h
T3GPPS_T3GPPS5_POSITION                  equ 0005h
T3GPPS_T3GPPS5_SIZE                      equ 0001h
T3GPPS_T3GPPS5_LENGTH                    equ 0001h
T3GPPS_T3GPPS5_MASK                      equ 0020h
T3GPPS_T3GPPS_POSN                       equ 0000h
T3GPPS_T3GPPS_POSITION                   equ 0000h
T3GPPS_T3GPPS_SIZE                       equ 0006h
T3GPPS_T3GPPS_LENGTH                     equ 0006h
T3GPPS_T3GPPS_MASK                       equ 003Fh

// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 0248h
// bitfield definitions
T2INPPS_PIN_POSN                         equ 0000h
T2INPPS_PIN_POSITION                     equ 0000h
T2INPPS_PIN_SIZE                         equ 0003h
T2INPPS_PIN_LENGTH                       equ 0003h
T2INPPS_PIN_MASK                         equ 0007h
T2INPPS_PORT_POSN                        equ 0003h
T2INPPS_PORT_POSITION                    equ 0003h
T2INPPS_PORT_SIZE                        equ 0003h
T2INPPS_PORT_LENGTH                      equ 0003h
T2INPPS_PORT_MASK                        equ 0038h
T2INPPS_T2INPPS0_POSN                    equ 0000h
T2INPPS_T2INPPS0_POSITION                equ 0000h
T2INPPS_T2INPPS0_SIZE                    equ 0001h
T2INPPS_T2INPPS0_LENGTH                  equ 0001h
T2INPPS_T2INPPS0_MASK                    equ 0001h
T2INPPS_T2INPPS1_POSN                    equ 0001h
T2INPPS_T2INPPS1_POSITION                equ 0001h
T2INPPS_T2INPPS1_SIZE                    equ 0001h
T2INPPS_T2INPPS1_LENGTH                  equ 0001h
T2INPPS_T2INPPS1_MASK                    equ 0002h
T2INPPS_T2INPPS2_POSN                    equ 0002h
T2INPPS_T2INPPS2_POSITION                equ 0002h
T2INPPS_T2INPPS2_SIZE                    equ 0001h
T2INPPS_T2INPPS2_LENGTH                  equ 0001h
T2INPPS_T2INPPS2_MASK                    equ 0004h
T2INPPS_T2INPPS3_POSN                    equ 0003h
T2INPPS_T2INPPS3_POSITION                equ 0003h
T2INPPS_T2INPPS3_SIZE                    equ 0001h
T2INPPS_T2INPPS3_LENGTH                  equ 0001h
T2INPPS_T2INPPS3_MASK                    equ 0008h
T2INPPS_T2INPPS4_POSN                    equ 0004h
T2INPPS_T2INPPS4_POSITION                equ 0004h
T2INPPS_T2INPPS4_SIZE                    equ 0001h
T2INPPS_T2INPPS4_LENGTH                  equ 0001h
T2INPPS_T2INPPS4_MASK                    equ 0010h
T2INPPS_T2INPPS5_POSN                    equ 0005h
T2INPPS_T2INPPS5_POSITION                equ 0005h
T2INPPS_T2INPPS5_SIZE                    equ 0001h
T2INPPS_T2INPPS5_LENGTH                  equ 0001h
T2INPPS_T2INPPS5_MASK                    equ 0020h
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0006h
T2INPPS_T2INPPS_LENGTH                   equ 0006h
T2INPPS_T2INPPS_MASK                     equ 003Fh

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 0249h
// bitfield definitions
T4INPPS_PIN_POSN                         equ 0000h
T4INPPS_PIN_POSITION                     equ 0000h
T4INPPS_PIN_SIZE                         equ 0003h
T4INPPS_PIN_LENGTH                       equ 0003h
T4INPPS_PIN_MASK                         equ 0007h
T4INPPS_PORT_POSN                        equ 0003h
T4INPPS_PORT_POSITION                    equ 0003h
T4INPPS_PORT_SIZE                        equ 0003h
T4INPPS_PORT_LENGTH                      equ 0003h
T4INPPS_PORT_MASK                        equ 0038h
T4INPPS_T4INPPS0_POSN                    equ 0000h
T4INPPS_T4INPPS0_POSITION                equ 0000h
T4INPPS_T4INPPS0_SIZE                    equ 0001h
T4INPPS_T4INPPS0_LENGTH                  equ 0001h
T4INPPS_T4INPPS0_MASK                    equ 0001h
T4INPPS_T4INPPS1_POSN                    equ 0001h
T4INPPS_T4INPPS1_POSITION                equ 0001h
T4INPPS_T4INPPS1_SIZE                    equ 0001h
T4INPPS_T4INPPS1_LENGTH                  equ 0001h
T4INPPS_T4INPPS1_MASK                    equ 0002h
T4INPPS_T4INPPS2_POSN                    equ 0002h
T4INPPS_T4INPPS2_POSITION                equ 0002h
T4INPPS_T4INPPS2_SIZE                    equ 0001h
T4INPPS_T4INPPS2_LENGTH                  equ 0001h
T4INPPS_T4INPPS2_MASK                    equ 0004h
T4INPPS_T4INPPS3_POSN                    equ 0003h
T4INPPS_T4INPPS3_POSITION                equ 0003h
T4INPPS_T4INPPS3_SIZE                    equ 0001h
T4INPPS_T4INPPS3_LENGTH                  equ 0001h
T4INPPS_T4INPPS3_MASK                    equ 0008h
T4INPPS_T4INPPS4_POSN                    equ 0004h
T4INPPS_T4INPPS4_POSITION                equ 0004h
T4INPPS_T4INPPS4_SIZE                    equ 0001h
T4INPPS_T4INPPS4_LENGTH                  equ 0001h
T4INPPS_T4INPPS4_MASK                    equ 0010h
T4INPPS_T4INPPS5_POSN                    equ 0005h
T4INPPS_T4INPPS5_POSITION                equ 0005h
T4INPPS_T4INPPS5_SIZE                    equ 0001h
T4INPPS_T4INPPS5_LENGTH                  equ 0001h
T4INPPS_T4INPPS5_MASK                    equ 0020h
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0006h
T4INPPS_T4INPPS_LENGTH                   equ 0006h
T4INPPS_T4INPPS_MASK                     equ 003Fh

// Register: T6INPPS
#define T6INPPS T6INPPS
T6INPPS                                  equ 024Ah
// bitfield definitions
T6INPPS_PIN_POSN                         equ 0000h
T6INPPS_PIN_POSITION                     equ 0000h
T6INPPS_PIN_SIZE                         equ 0003h
T6INPPS_PIN_LENGTH                       equ 0003h
T6INPPS_PIN_MASK                         equ 0007h
T6INPPS_PORT_POSN                        equ 0003h
T6INPPS_PORT_POSITION                    equ 0003h
T6INPPS_PORT_SIZE                        equ 0003h
T6INPPS_PORT_LENGTH                      equ 0003h
T6INPPS_PORT_MASK                        equ 0038h
T6INPPS_T6INPPS0_POSN                    equ 0000h
T6INPPS_T6INPPS0_POSITION                equ 0000h
T6INPPS_T6INPPS0_SIZE                    equ 0001h
T6INPPS_T6INPPS0_LENGTH                  equ 0001h
T6INPPS_T6INPPS0_MASK                    equ 0001h
T6INPPS_T6INPPS1_POSN                    equ 0001h
T6INPPS_T6INPPS1_POSITION                equ 0001h
T6INPPS_T6INPPS1_SIZE                    equ 0001h
T6INPPS_T6INPPS1_LENGTH                  equ 0001h
T6INPPS_T6INPPS1_MASK                    equ 0002h
T6INPPS_T6INPPS2_POSN                    equ 0002h
T6INPPS_T6INPPS2_POSITION                equ 0002h
T6INPPS_T6INPPS2_SIZE                    equ 0001h
T6INPPS_T6INPPS2_LENGTH                  equ 0001h
T6INPPS_T6INPPS2_MASK                    equ 0004h
T6INPPS_T6INPPS3_POSN                    equ 0003h
T6INPPS_T6INPPS3_POSITION                equ 0003h
T6INPPS_T6INPPS3_SIZE                    equ 0001h
T6INPPS_T6INPPS3_LENGTH                  equ 0001h
T6INPPS_T6INPPS3_MASK                    equ 0008h
T6INPPS_T6INPPS4_POSN                    equ 0004h
T6INPPS_T6INPPS4_POSITION                equ 0004h
T6INPPS_T6INPPS4_SIZE                    equ 0001h
T6INPPS_T6INPPS4_LENGTH                  equ 0001h
T6INPPS_T6INPPS4_MASK                    equ 0010h
T6INPPS_T6INPPS5_POSN                    equ 0005h
T6INPPS_T6INPPS5_POSITION                equ 0005h
T6INPPS_T6INPPS5_SIZE                    equ 0001h
T6INPPS_T6INPPS5_LENGTH                  equ 0001h
T6INPPS_T6INPPS5_MASK                    equ 0020h
T6INPPS_T6INPPS_POSN                     equ 0000h
T6INPPS_T6INPPS_POSITION                 equ 0000h
T6INPPS_T6INPPS_SIZE                     equ 0006h
T6INPPS_T6INPPS_LENGTH                   equ 0006h
T6INPPS_T6INPPS_MASK                     equ 003Fh

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 024Fh
// bitfield definitions
CCP1PPS_PIN_POSN                         equ 0000h
CCP1PPS_PIN_POSITION                     equ 0000h
CCP1PPS_PIN_SIZE                         equ 0003h
CCP1PPS_PIN_LENGTH                       equ 0003h
CCP1PPS_PIN_MASK                         equ 0007h
CCP1PPS_PORT_POSN                        equ 0003h
CCP1PPS_PORT_POSITION                    equ 0003h
CCP1PPS_PORT_SIZE                        equ 0003h
CCP1PPS_PORT_LENGTH                      equ 0003h
CCP1PPS_PORT_MASK                        equ 0038h
CCP1PPS_CCP1PPS0_POSN                    equ 0000h
CCP1PPS_CCP1PPS0_POSITION                equ 0000h
CCP1PPS_CCP1PPS0_SIZE                    equ 0001h
CCP1PPS_CCP1PPS0_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS0_MASK                    equ 0001h
CCP1PPS_CCP1PPS1_POSN                    equ 0001h
CCP1PPS_CCP1PPS1_POSITION                equ 0001h
CCP1PPS_CCP1PPS1_SIZE                    equ 0001h
CCP1PPS_CCP1PPS1_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS1_MASK                    equ 0002h
CCP1PPS_CCP1PPS2_POSN                    equ 0002h
CCP1PPS_CCP1PPS2_POSITION                equ 0002h
CCP1PPS_CCP1PPS2_SIZE                    equ 0001h
CCP1PPS_CCP1PPS2_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS2_MASK                    equ 0004h
CCP1PPS_CCP1PPS3_POSN                    equ 0003h
CCP1PPS_CCP1PPS3_POSITION                equ 0003h
CCP1PPS_CCP1PPS3_SIZE                    equ 0001h
CCP1PPS_CCP1PPS3_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS3_MASK                    equ 0008h
CCP1PPS_CCP1PPS4_POSN                    equ 0004h
CCP1PPS_CCP1PPS4_POSITION                equ 0004h
CCP1PPS_CCP1PPS4_SIZE                    equ 0001h
CCP1PPS_CCP1PPS4_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS4_MASK                    equ 0010h
CCP1PPS_CCP1PPS5_POSN                    equ 0005h
CCP1PPS_CCP1PPS5_POSITION                equ 0005h
CCP1PPS_CCP1PPS5_SIZE                    equ 0001h
CCP1PPS_CCP1PPS5_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS5_MASK                    equ 0020h
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0006h
CCP1PPS_CCP1PPS_LENGTH                   equ 0006h
CCP1PPS_CCP1PPS_MASK                     equ 003Fh

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 0250h
// bitfield definitions
CCP2PPS_PIN_POSN                         equ 0000h
CCP2PPS_PIN_POSITION                     equ 0000h
CCP2PPS_PIN_SIZE                         equ 0003h
CCP2PPS_PIN_LENGTH                       equ 0003h
CCP2PPS_PIN_MASK                         equ 0007h
CCP2PPS_PORT_POSN                        equ 0003h
CCP2PPS_PORT_POSITION                    equ 0003h
CCP2PPS_PORT_SIZE                        equ 0003h
CCP2PPS_PORT_LENGTH                      equ 0003h
CCP2PPS_PORT_MASK                        equ 0038h
CCP2PPS_CCP2PPS0_POSN                    equ 0000h
CCP2PPS_CCP2PPS0_POSITION                equ 0000h
CCP2PPS_CCP2PPS0_SIZE                    equ 0001h
CCP2PPS_CCP2PPS0_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS0_MASK                    equ 0001h
CCP2PPS_CCP2PPS1_POSN                    equ 0001h
CCP2PPS_CCP2PPS1_POSITION                equ 0001h
CCP2PPS_CCP2PPS1_SIZE                    equ 0001h
CCP2PPS_CCP2PPS1_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS1_MASK                    equ 0002h
CCP2PPS_CCP2PPS2_POSN                    equ 0002h
CCP2PPS_CCP2PPS2_POSITION                equ 0002h
CCP2PPS_CCP2PPS2_SIZE                    equ 0001h
CCP2PPS_CCP2PPS2_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS2_MASK                    equ 0004h
CCP2PPS_CCP2PPS3_POSN                    equ 0003h
CCP2PPS_CCP2PPS3_POSITION                equ 0003h
CCP2PPS_CCP2PPS3_SIZE                    equ 0001h
CCP2PPS_CCP2PPS3_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS3_MASK                    equ 0008h
CCP2PPS_CCP2PPS4_POSN                    equ 0004h
CCP2PPS_CCP2PPS4_POSITION                equ 0004h
CCP2PPS_CCP2PPS4_SIZE                    equ 0001h
CCP2PPS_CCP2PPS4_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS4_MASK                    equ 0010h
CCP2PPS_CCP2PPS5_POSN                    equ 0005h
CCP2PPS_CCP2PPS5_POSITION                equ 0005h
CCP2PPS_CCP2PPS5_SIZE                    equ 0001h
CCP2PPS_CCP2PPS5_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS5_MASK                    equ 0020h
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0006h
CCP2PPS_CCP2PPS_LENGTH                   equ 0006h
CCP2PPS_CCP2PPS_MASK                     equ 003Fh

// Register: PWM1ERSPPS
#define PWM1ERSPPS PWM1ERSPPS
PWM1ERSPPS                               equ 0251h
// bitfield definitions
PWM1ERSPPS_PIN_POSN                      equ 0000h
PWM1ERSPPS_PIN_POSITION                  equ 0000h
PWM1ERSPPS_PIN_SIZE                      equ 0003h
PWM1ERSPPS_PIN_LENGTH                    equ 0003h
PWM1ERSPPS_PIN_MASK                      equ 0007h
PWM1ERSPPS_PORT_POSN                     equ 0003h
PWM1ERSPPS_PORT_POSITION                 equ 0003h
PWM1ERSPPS_PORT_SIZE                     equ 0003h
PWM1ERSPPS_PORT_LENGTH                   equ 0003h
PWM1ERSPPS_PORT_MASK                     equ 0038h
PWM1ERSPPS_PWM1ERSPPS0_POSN              equ 0000h
PWM1ERSPPS_PWM1ERSPPS0_POSITION          equ 0000h
PWM1ERSPPS_PWM1ERSPPS0_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS0_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS0_MASK              equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_POSN              equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_POSITION          equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_MASK              equ 0002h
PWM1ERSPPS_PWM1ERSPPS2_POSN              equ 0002h
PWM1ERSPPS_PWM1ERSPPS2_POSITION          equ 0002h
PWM1ERSPPS_PWM1ERSPPS2_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS2_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS2_MASK              equ 0004h
PWM1ERSPPS_PWM1ERSPPS3_POSN              equ 0003h
PWM1ERSPPS_PWM1ERSPPS3_POSITION          equ 0003h
PWM1ERSPPS_PWM1ERSPPS3_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS3_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS3_MASK              equ 0008h
PWM1ERSPPS_PWM1ERSPPS4_POSN              equ 0004h
PWM1ERSPPS_PWM1ERSPPS4_POSITION          equ 0004h
PWM1ERSPPS_PWM1ERSPPS4_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS4_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS4_MASK              equ 0010h
PWM1ERSPPS_PWM1ERSPPS5_POSN              equ 0005h
PWM1ERSPPS_PWM1ERSPPS5_POSITION          equ 0005h
PWM1ERSPPS_PWM1ERSPPS5_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS5_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS5_MASK              equ 0020h
PWM1ERSPPS_PWM1ERSPPS_POSN               equ 0000h
PWM1ERSPPS_PWM1ERSPPS_POSITION           equ 0000h
PWM1ERSPPS_PWM1ERSPPS_SIZE               equ 0006h
PWM1ERSPPS_PWM1ERSPPS_LENGTH             equ 0006h
PWM1ERSPPS_PWM1ERSPPS_MASK               equ 003Fh

// Register: PWM2ERSPPS
#define PWM2ERSPPS PWM2ERSPPS
PWM2ERSPPS                               equ 0252h
// bitfield definitions
PWM2ERSPPS_PIN_POSN                      equ 0000h
PWM2ERSPPS_PIN_POSITION                  equ 0000h
PWM2ERSPPS_PIN_SIZE                      equ 0003h
PWM2ERSPPS_PIN_LENGTH                    equ 0003h
PWM2ERSPPS_PIN_MASK                      equ 0007h
PWM2ERSPPS_PORT_POSN                     equ 0003h
PWM2ERSPPS_PORT_POSITION                 equ 0003h
PWM2ERSPPS_PORT_SIZE                     equ 0003h
PWM2ERSPPS_PORT_LENGTH                   equ 0003h
PWM2ERSPPS_PORT_MASK                     equ 0038h
PWM2ERSPPS_PWM2ERSPPS0_POSN              equ 0000h
PWM2ERSPPS_PWM2ERSPPS0_POSITION          equ 0000h
PWM2ERSPPS_PWM2ERSPPS0_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS0_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS0_MASK              equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_POSN              equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_POSITION          equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_MASK              equ 0002h
PWM2ERSPPS_PWM2ERSPPS2_POSN              equ 0002h
PWM2ERSPPS_PWM2ERSPPS2_POSITION          equ 0002h
PWM2ERSPPS_PWM2ERSPPS2_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS2_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS2_MASK              equ 0004h
PWM2ERSPPS_PWM2ERSPPS3_POSN              equ 0003h
PWM2ERSPPS_PWM2ERSPPS3_POSITION          equ 0003h
PWM2ERSPPS_PWM2ERSPPS3_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS3_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS3_MASK              equ 0008h
PWM2ERSPPS_PWM2ERSPPS4_POSN              equ 0004h
PWM2ERSPPS_PWM2ERSPPS4_POSITION          equ 0004h
PWM2ERSPPS_PWM2ERSPPS4_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS4_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS4_MASK              equ 0010h
PWM2ERSPPS_PWM2ERSPPS5_POSN              equ 0005h
PWM2ERSPPS_PWM2ERSPPS5_POSITION          equ 0005h
PWM2ERSPPS_PWM2ERSPPS5_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS5_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS5_MASK              equ 0020h
PWM2ERSPPS_PWM2ERSPPS_POSN               equ 0000h
PWM2ERSPPS_PWM2ERSPPS_POSITION           equ 0000h
PWM2ERSPPS_PWM2ERSPPS_SIZE               equ 0006h
PWM2ERSPPS_PWM2ERSPPS_LENGTH             equ 0006h
PWM2ERSPPS_PWM2ERSPPS_MASK               equ 003Fh

