garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f56q24.inc
// Register: TU16APRT
#define TU16APRT TU16APRT
TU16APRT                                 equ 03A8h
// bitfield definitions
TU16APRT_PRT_POSN                        equ 0000h
TU16APRT_PRT_POSITION                    equ 0000h
TU16APRT_PRT_SIZE                        equ 0008h
TU16APRT_PRT_LENGTH                      equ 0008h
TU16APRT_PRT_MASK                        equ 00FFh
TU16APRT_PRT0_POSN                       equ 0000h
TU16APRT_PRT0_POSITION                   equ 0000h
TU16APRT_PRT0_SIZE                       equ 0001h
TU16APRT_PRT0_LENGTH                     equ 0001h
TU16APRT_PRT0_MASK                       equ 0001h
TU16APRT_PRT1_POSN                       equ 0001h
TU16APRT_PRT1_POSITION                   equ 0001h
TU16APRT_PRT1_SIZE                       equ 0001h
TU16APRT_PRT1_LENGTH                     equ 0001h
TU16APRT_PRT1_MASK                       equ 0002h
TU16APRT_PRT2_POSN                       equ 0002h
TU16APRT_PRT2_POSITION                   equ 0002h
TU16APRT_PRT2_SIZE                       equ 0001h
TU16APRT_PRT2_LENGTH                     equ 0001h
TU16APRT_PRT2_MASK                       equ 0004h
TU16APRT_PRT3_POSN                       equ 0003h
TU16APRT_PRT3_POSITION                   equ 0003h
TU16APRT_PRT3_SIZE                       equ 0001h
TU16APRT_PRT3_LENGTH                     equ 0001h
TU16APRT_PRT3_MASK                       equ 0008h
TU16APRT_PRT4_POSN                       equ 0004h
TU16APRT_PRT4_POSITION                   equ 0004h
TU16APRT_PRT4_SIZE                       equ 0001h
TU16APRT_PRT4_LENGTH                     equ 0001h
TU16APRT_PRT4_MASK                       equ 0010h
TU16APRT_PRT5_POSN                       equ 0005h
TU16APRT_PRT5_POSITION                   equ 0005h
TU16APRT_PRT5_SIZE                       equ 0001h
TU16APRT_PRT5_LENGTH                     equ 0001h
TU16APRT_PRT5_MASK                       equ 0020h
TU16APRT_PRT6_POSN                       equ 0006h
TU16APRT_PRT6_POSITION                   equ 0006h
TU16APRT_PRT6_SIZE                       equ 0001h
TU16APRT_PRT6_LENGTH                     equ 0001h
TU16APRT_PRT6_MASK                       equ 0040h
TU16APRT_PRT7_POSN                       equ 0007h
TU16APRT_PRT7_POSITION                   equ 0007h
TU16APRT_PRT7_SIZE                       equ 0001h
TU16APRT_PRT7_LENGTH                     equ 0001h
TU16APRT_PRT7_MASK                       equ 0080h
TU16APRT_TU16APRT0_POSN                  equ 0000h
TU16APRT_TU16APRT0_POSITION              equ 0000h
TU16APRT_TU16APRT0_SIZE                  equ 0001h
TU16APRT_TU16APRT0_LENGTH                equ 0001h
TU16APRT_TU16APRT0_MASK                  equ 0001h
TU16APRT_TU16APRT1_POSN                  equ 0001h
TU16APRT_TU16APRT1_POSITION              equ 0001h
TU16APRT_TU16APRT1_SIZE                  equ 0001h
TU16APRT_TU16APRT1_LENGTH                equ 0001h
TU16APRT_TU16APRT1_MASK                  equ 0002h
TU16APRT_TU16APRT2_POSN                  equ 0002h
TU16APRT_TU16APRT2_POSITION              equ 0002h
TU16APRT_TU16APRT2_SIZE                  equ 0001h
TU16APRT_TU16APRT2_LENGTH                equ 0001h
TU16APRT_TU16APRT2_MASK                  equ 0004h
TU16APRT_TU16APRT3_POSN                  equ 0003h
TU16APRT_TU16APRT3_POSITION              equ 0003h
TU16APRT_TU16APRT3_SIZE                  equ 0001h
TU16APRT_TU16APRT3_LENGTH                equ 0001h
TU16APRT_TU16APRT3_MASK                  equ 0008h
TU16APRT_TU16APRT4_POSN                  equ 0004h
TU16APRT_TU16APRT4_POSITION              equ 0004h
TU16APRT_TU16APRT4_SIZE                  equ 0001h
TU16APRT_TU16APRT4_LENGTH                equ 0001h
TU16APRT_TU16APRT4_MASK                  equ 0010h
TU16APRT_TU16APRT5_POSN                  equ 0005h
TU16APRT_TU16APRT5_POSITION              equ 0005h
TU16APRT_TU16APRT5_SIZE                  equ 0001h
TU16APRT_TU16APRT5_LENGTH                equ 0001h
TU16APRT_TU16APRT5_MASK                  equ 0020h
TU16APRT_TU16APRT6_POSN                  equ 0006h
TU16APRT_TU16APRT6_POSITION              equ 0006h
TU16APRT_TU16APRT6_SIZE                  equ 0001h
TU16APRT_TU16APRT6_LENGTH                equ 0001h
TU16APRT_TU16APRT6_MASK                  equ 0040h
TU16APRT_TU16APRT7_POSN                  equ 0007h
TU16APRT_TU16APRT7_POSITION              equ 0007h
TU16APRT_TU16APRT7_SIZE                  equ 0001h
TU16APRT_TU16APRT7_LENGTH                equ 0001h
TU16APRT_TU16APRT7_MASK                  equ 0080h
TU16APRT_TU16APR24_POSN                  equ 0000h
TU16APRT_TU16APR24_POSITION              equ 0000h
TU16APRT_TU16APR24_SIZE                  equ 0001h
TU16APRT_TU16APR24_LENGTH                equ 0001h
TU16APRT_TU16APR24_MASK                  equ 0001h
TU16APRT_TU16APR25_POSN                  equ 0001h
TU16APRT_TU16APR25_POSITION              equ 0001h
TU16APRT_TU16APR25_SIZE                  equ 0001h
TU16APRT_TU16APR25_LENGTH                equ 0001h
TU16APRT_TU16APR25_MASK                  equ 0002h
TU16APRT_TU16APR26_POSN                  equ 0002h
TU16APRT_TU16APR26_POSITION              equ 0002h
TU16APRT_TU16APR26_SIZE                  equ 0001h
TU16APRT_TU16APR26_LENGTH                equ 0001h
TU16APRT_TU16APR26_MASK                  equ 0004h
TU16APRT_TU16APR27_POSN                  equ 0003h
TU16APRT_TU16APR27_POSITION              equ 0003h
TU16APRT_TU16APR27_SIZE                  equ 0001h
TU16APRT_TU16APR27_LENGTH                equ 0001h
TU16APRT_TU16APR27_MASK                  equ 0008h
TU16APRT_TU16APR28_POSN                  equ 0004h
TU16APRT_TU16APR28_POSITION              equ 0004h
TU16APRT_TU16APR28_SIZE                  equ 0001h
TU16APRT_TU16APR28_LENGTH                equ 0001h
TU16APRT_TU16APR28_MASK                  equ 0010h
TU16APRT_TU16APR29_POSN                  equ 0005h
TU16APRT_TU16APR29_POSITION              equ 0005h
TU16APRT_TU16APR29_SIZE                  equ 0001h
TU16APRT_TU16APR29_LENGTH                equ 0001h
TU16APRT_TU16APR29_MASK                  equ 0020h
TU16APRT_TU16APR30_POSN                  equ 0006h
TU16APRT_TU16APR30_POSITION              equ 0006h
TU16APRT_TU16APR30_SIZE                  equ 0001h
TU16APRT_TU16APR30_LENGTH                equ 0001h
TU16APRT_TU16APR30_MASK                  equ 0040h
TU16APRT_TU16APR31_POSN                  equ 0007h
TU16APRT_TU16APR31_POSITION              equ 0007h
TU16APRT_TU16APR31_SIZE                  equ 0001h
TU16APRT_TU16APR31_LENGTH                equ 0001h
TU16APRT_TU16APR31_MASK                  equ 0080h

// Register: TU16ACLK
#define TU16ACLK TU16ACLK
TU16ACLK                                 equ 03A9h
// bitfield definitions
TU16ACLK_CLK_POSN                        equ 0000h
TU16ACLK_CLK_POSITION                    equ 0000h
TU16ACLK_CLK_SIZE                        equ 0008h
TU16ACLK_CLK_LENGTH                      equ 0008h
TU16ACLK_CLK_MASK                        equ 00FFh
TU16ACLK_CLK0_POSN                       equ 0000h
TU16ACLK_CLK0_POSITION                   equ 0000h
TU16ACLK_CLK0_SIZE                       equ 0001h
TU16ACLK_CLK0_LENGTH                     equ 0001h
TU16ACLK_CLK0_MASK                       equ 0001h
TU16ACLK_CLK1_POSN                       equ 0001h
TU16ACLK_CLK1_POSITION                   equ 0001h
TU16ACLK_CLK1_SIZE                       equ 0001h
TU16ACLK_CLK1_LENGTH                     equ 0001h
TU16ACLK_CLK1_MASK                       equ 0002h
TU16ACLK_CLK2_POSN                       equ 0002h
TU16ACLK_CLK2_POSITION                   equ 0002h
TU16ACLK_CLK2_SIZE                       equ 0001h
TU16ACLK_CLK2_LENGTH                     equ 0001h
TU16ACLK_CLK2_MASK                       equ 0004h
TU16ACLK_CLK3_POSN                       equ 0003h
TU16ACLK_CLK3_POSITION                   equ 0003h
TU16ACLK_CLK3_SIZE                       equ 0001h
TU16ACLK_CLK3_LENGTH                     equ 0001h
TU16ACLK_CLK3_MASK                       equ 0008h
TU16ACLK_CLK4_POSN                       equ 0004h
TU16ACLK_CLK4_POSITION                   equ 0004h
TU16ACLK_CLK4_SIZE                       equ 0001h
TU16ACLK_CLK4_LENGTH                     equ 0001h
TU16ACLK_CLK4_MASK                       equ 0010h
TU16ACLK_TU16ACLK0_POSN                  equ 0000h
TU16ACLK_TU16ACLK0_POSITION              equ 0000h
TU16ACLK_TU16ACLK0_SIZE                  equ 0001h
TU16ACLK_TU16ACLK0_LENGTH                equ 0001h
TU16ACLK_TU16ACLK0_MASK                  equ 0001h
TU16ACLK_TU16ACLK1_POSN                  equ 0001h
TU16ACLK_TU16ACLK1_POSITION              equ 0001h
TU16ACLK_TU16ACLK1_SIZE                  equ 0001h
TU16ACLK_TU16ACLK1_LENGTH                equ 0001h
TU16ACLK_TU16ACLK1_MASK                  equ 0002h
TU16ACLK_TU16ACLK2_POSN                  equ 0002h
TU16ACLK_TU16ACLK2_POSITION              equ 0002h
TU16ACLK_TU16ACLK2_SIZE                  equ 0001h
TU16ACLK_TU16ACLK2_LENGTH                equ 0001h
TU16ACLK_TU16ACLK2_MASK                  equ 0004h
TU16ACLK_TU16ACLK3_POSN                  equ 0003h
TU16ACLK_TU16ACLK3_POSITION              equ 0003h
TU16ACLK_TU16ACLK3_SIZE                  equ 0001h
TU16ACLK_TU16ACLK3_LENGTH                equ 0001h
TU16ACLK_TU16ACLK3_MASK                  equ 0008h
TU16ACLK_TU16ACLK4_POSN                  equ 0004h
TU16ACLK_TU16ACLK4_POSITION              equ 0004h
TU16ACLK_TU16ACLK4_SIZE                  equ 0001h
TU16ACLK_TU16ACLK4_LENGTH                equ 0001h
TU16ACLK_TU16ACLK4_MASK                  equ 0010h

// Register: TU16AERS
#define TU16AERS TU16AERS
TU16AERS                                 equ 03AAh
// bitfield definitions
TU16AERS_ERS_POSN                        equ 0000h
TU16AERS_ERS_POSITION                    equ 0000h
TU16AERS_ERS_SIZE                        equ 0008h
TU16AERS_ERS_LENGTH                      equ 0008h
TU16AERS_ERS_MASK                        equ 00FFh
TU16AERS_ERS0_POSN                       equ 0000h
TU16AERS_ERS0_POSITION                   equ 0000h
TU16AERS_ERS0_SIZE                       equ 0001h
TU16AERS_ERS0_LENGTH                     equ 0001h
TU16AERS_ERS0_MASK                       equ 0001h
TU16AERS_ERS1_POSN                       equ 0001h
TU16AERS_ERS1_POSITION                   equ 0001h
TU16AERS_ERS1_SIZE                       equ 0001h
TU16AERS_ERS1_LENGTH                     equ 0001h
TU16AERS_ERS1_MASK                       equ 0002h
TU16AERS_ERS2_POSN                       equ 0002h
TU16AERS_ERS2_POSITION                   equ 0002h
TU16AERS_ERS2_SIZE                       equ 0001h
TU16AERS_ERS2_LENGTH                     equ 0001h
TU16AERS_ERS2_MASK                       equ 0004h
TU16AERS_ERS3_POSN                       equ 0003h
TU16AERS_ERS3_POSITION                   equ 0003h
TU16AERS_ERS3_SIZE                       equ 0001h
TU16AERS_ERS3_LENGTH                     equ 0001h
TU16AERS_ERS3_MASK                       equ 0008h
TU16AERS_ERS4_POSN                       equ 0004h
TU16AERS_ERS4_POSITION                   equ 0004h
TU16AERS_ERS4_SIZE                       equ 0001h
TU16AERS_ERS4_LENGTH                     equ 0001h
TU16AERS_ERS4_MASK                       equ 0010h
TU16AERS_ERS5_POSN                       equ 0005h
TU16AERS_ERS5_POSITION                   equ 0005h
TU16AERS_ERS5_SIZE                       equ 0001h
TU16AERS_ERS5_LENGTH                     equ 0001h
TU16AERS_ERS5_MASK                       equ 0020h
TU16AERS_TU16AERS0_POSN                  equ 0000h
TU16AERS_TU16AERS0_POSITION              equ 0000h
TU16AERS_TU16AERS0_SIZE                  equ 0001h
TU16AERS_TU16AERS0_LENGTH                equ 0001h
TU16AERS_TU16AERS0_MASK                  equ 0001h
TU16AERS_TU16AERS1_POSN                  equ 0001h
TU16AERS_TU16AERS1_POSITION              equ 0001h
TU16AERS_TU16AERS1_SIZE                  equ 0001h
TU16AERS_TU16AERS1_LENGTH                equ 0001h
TU16AERS_TU16AERS1_MASK                  equ 0002h
TU16AERS_TU16AERS2_POSN                  equ 0002h
TU16AERS_TU16AERS2_POSITION              equ 0002h
TU16AERS_TU16AERS2_SIZE                  equ 0001h
TU16AERS_TU16AERS2_LENGTH                equ 0001h
TU16AERS_TU16AERS2_MASK                  equ 0004h
TU16AERS_TU16AERS3_POSN                  equ 0003h
TU16AERS_TU16AERS3_POSITION              equ 0003h
TU16AERS_TU16AERS3_SIZE                  equ 0001h
TU16AERS_TU16AERS3_LENGTH                equ 0001h
TU16AERS_TU16AERS3_MASK                  equ 0008h
TU16AERS_TU16AERS4_POSN                  equ 0004h
TU16AERS_TU16AERS4_POSITION              equ 0004h
TU16AERS_TU16AERS4_SIZE                  equ 0001h
TU16AERS_TU16AERS4_LENGTH                equ 0001h
TU16AERS_TU16AERS4_MASK                  equ 0010h
TU16AERS_TU16AERS5_POSN                  equ 0005h
TU16AERS_TU16AERS5_POSITION              equ 0005h
TU16AERS_TU16AERS5_SIZE                  equ 0001h
TU16AERS_TU16AERS5_LENGTH                equ 0001h
TU16AERS_TU16AERS5_MASK                  equ 0020h

// Register: TU16BCON0
#define TU16BCON0 TU16BCON0
TU16BCON0                                equ 03ABh
// bitfield definitions
TU16BCON0_CIE_POSN                       equ 0000h
TU16BCON0_CIE_POSITION                   equ 0000h
TU16BCON0_CIE_SIZE                       equ 0001h
TU16BCON0_CIE_LENGTH                     equ 0001h
TU16BCON0_CIE_MASK                       equ 0001h
TU16BCON0_ZIE_POSN                       equ 0001h
TU16BCON0_ZIE_POSITION                   equ 0001h
TU16BCON0_ZIE_SIZE                       equ 0001h
TU16BCON0_ZIE_LENGTH                     equ 0001h
TU16BCON0_ZIE_MASK                       equ 0002h
TU16BCON0_PRIE_POSN                      equ 0002h
TU16BCON0_PRIE_POSITION                  equ 0002h
TU16BCON0_PRIE_SIZE                      equ 0001h
TU16BCON0_PRIE_LENGTH                    equ 0001h
TU16BCON0_PRIE_MASK                      equ 0004h
TU16BCON0_RDSEL_POSN                     equ 0003h
TU16BCON0_RDSEL_POSITION                 equ 0003h
TU16BCON0_RDSEL_SIZE                     equ 0001h
TU16BCON0_RDSEL_LENGTH                   equ 0001h
TU16BCON0_RDSEL_MASK                     equ 0008h
TU16BCON0_OPOL_POSN                      equ 0004h
TU16BCON0_OPOL_POSITION                  equ 0004h
TU16BCON0_OPOL_SIZE                      equ 0001h
TU16BCON0_OPOL_LENGTH                    equ 0001h
TU16BCON0_OPOL_MASK                      equ 0010h
TU16BCON0_OM_POSN                        equ 0005h
TU16BCON0_OM_POSITION                    equ 0005h
TU16BCON0_OM_SIZE                        equ 0001h
TU16BCON0_OM_LENGTH                      equ 0001h
TU16BCON0_OM_MASK                        equ 0020h
TU16BCON0_CPOL_POSN                      equ 0006h
TU16BCON0_CPOL_POSITION                  equ 0006h
TU16BCON0_CPOL_SIZE                      equ 0001h
TU16BCON0_CPOL_LENGTH                    equ 0001h
TU16BCON0_CPOL_MASK                      equ 0040h
TU16BCON0_ON_POSN                        equ 0007h
TU16BCON0_ON_POSITION                    equ 0007h
TU16BCON0_ON_SIZE                        equ 0001h
TU16BCON0_ON_LENGTH                      equ 0001h
TU16BCON0_ON_MASK                        equ 0080h
TU16BCON0_TU16BCIE_POSN                  equ 0000h
TU16BCON0_TU16BCIE_POSITION              equ 0000h
TU16BCON0_TU16BCIE_SIZE                  equ 0001h
TU16BCON0_TU16BCIE_LENGTH                equ 0001h
TU16BCON0_TU16BCIE_MASK                  equ 0001h
TU16BCON0_TU16BZIE_POSN                  equ 0001h
TU16BCON0_TU16BZIE_POSITION              equ 0001h
TU16BCON0_TU16BZIE_SIZE                  equ 0001h
TU16BCON0_TU16BZIE_LENGTH                equ 0001h
TU16BCON0_TU16BZIE_MASK                  equ 0002h
TU16BCON0_TU16BPRIE_POSN                 equ 0002h
TU16BCON0_TU16BPRIE_POSITION             equ 0002h
TU16BCON0_TU16BPRIE_SIZE                 equ 0001h
TU16BCON0_TU16BPRIE_LENGTH               equ 0001h
TU16BCON0_TU16BPRIE_MASK                 equ 0004h
TU16BCON0_TU16BRDSEL_POSN                equ 0003h
TU16BCON0_TU16BRDSEL_POSITION            equ 0003h
TU16BCON0_TU16BRDSEL_SIZE                equ 0001h
TU16BCON0_TU16BRDSEL_LENGTH              equ 0001h
TU16BCON0_TU16BRDSEL_MASK                equ 0008h
TU16BCON0_TU16BOPOL_POSN                 equ 0004h
TU16BCON0_TU16BOPOL_POSITION             equ 0004h
TU16BCON0_TU16BOPOL_SIZE                 equ 0001h
TU16BCON0_TU16BOPOL_LENGTH               equ 0001h
TU16BCON0_TU16BOPOL_MASK                 equ 0010h
TU16BCON0_TU16BOM_POSN                   equ 0005h
TU16BCON0_TU16BOM_POSITION               equ 0005h
TU16BCON0_TU16BOM_SIZE                   equ 0001h
TU16BCON0_TU16BOM_LENGTH                 equ 0001h
TU16BCON0_TU16BOM_MASK                   equ 0020h
TU16BCON0_TU16BCPOL_POSN                 equ 0006h
TU16BCON0_TU16BCPOL_POSITION             equ 0006h
TU16BCON0_TU16BCPOL_SIZE                 equ 0001h
TU16BCON0_TU16BCPOL_LENGTH               equ 0001h
TU16BCON0_TU16BCPOL_MASK                 equ 0040h
TU16BCON0_TU16BON_POSN                   equ 0007h
TU16BCON0_TU16BON_POSITION               equ 0007h
TU16BCON0_TU16BON_SIZE                   equ 0001h
TU16BCON0_TU16BON_LENGTH                 equ 0001h
TU16BCON0_TU16BON_MASK                   equ 0080h

// Register: TU16BCON1
#define TU16BCON1 TU16BCON1
TU16BCON1                                equ 03ACh
// bitfield definitions
TU16BCON1_CIF_POSN                       equ 0000h
TU16BCON1_CIF_POSITION                   equ 0000h
TU16BCON1_CIF_SIZE                       equ 0001h
TU16BCON1_CIF_LENGTH                     equ 0001h
TU16BCON1_CIF_MASK                       equ 0001h
TU16BCON1_ZIF_POSN                       equ 0001h
TU16BCON1_ZIF_POSITION                   equ 0001h
TU16BCON1_ZIF_SIZE                       equ 0001h
TU16BCON1_ZIF_LENGTH                     equ 0001h
TU16BCON1_ZIF_MASK                       equ 0002h
TU16BCON1_PRIF_POSN                      equ 0002h
TU16BCON1_PRIF_POSITION                  equ 0002h
TU16BCON1_PRIF_SIZE                      equ 0001h
TU16BCON1_PRIF_LENGTH                    equ 0001h
TU16BCON1_PRIF_MASK                      equ 0004h
TU16BCON1_CAPT_POSN                      equ 0003h
TU16BCON1_CAPT_POSITION                  equ 0003h
TU16BCON1_CAPT_SIZE                      equ 0001h
TU16BCON1_CAPT_LENGTH                    equ 0001h
TU16BCON1_CAPT_MASK                      equ 0008h
TU16BCON1_LIMIT_POSN                     equ 0004h
TU16BCON1_LIMIT_POSITION                 equ 0004h
TU16BCON1_LIMIT_SIZE                     equ 0001h
TU16BCON1_LIMIT_LENGTH                   equ 0001h
TU16BCON1_LIMIT_MASK                     equ 0010h
TU16BCON1_CLR_POSN                       equ 0005h
TU16BCON1_CLR_POSITION                   equ 0005h
TU16BCON1_CLR_SIZE                       equ 0001h
TU16BCON1_CLR_LENGTH                     equ 0001h
TU16BCON1_CLR_MASK                       equ 0020h
TU16BCON1_OSEN_POSN                      equ 0006h
TU16BCON1_OSEN_POSITION                  equ 0006h
TU16BCON1_OSEN_SIZE                      equ 0001h
TU16BCON1_OSEN_LENGTH                    equ 0001h
TU16BCON1_OSEN_MASK                      equ 0040h
TU16BCON1_RUN_POSN                       equ 0007h
TU16BCON1_RUN_POSITION                   equ 0007h
TU16BCON1_RUN_SIZE                       equ 0001h
TU16BCON1_RUN_LENGTH                     equ 0001h
TU16BCON1_RUN_MASK                       equ 0080h
TU16BCON1_TU16BCIF_POSN                  equ 0000h
TU16BCON1_TU16BCIF_POSITION              equ 0000h
TU16BCON1_TU16BCIF_SIZE                  equ 0001h
TU16BCON1_TU16BCIF_LENGTH                equ 0001h
TU16BCON1_TU16BCIF_MASK                  equ 0001h
TU16BCON1_TU16BZIF_POSN                  equ 0001h
TU16BCON1_TU16BZIF_POSITION              equ 0001h
TU16BCON1_TU16BZIF_SIZE                  equ 0001h
TU16BCON1_TU16BZIF_LENGTH                equ 0001h
TU16BCON1_TU16BZIF_MASK                  equ 0002h
TU16BCON1_TU16BPRIF_POSN                 equ 0002h
TU16BCON1_TU16BPRIF_POSITION             equ 0002h
TU16BCON1_TU16BPRIF_SIZE                 equ 0001h
TU16BCON1_TU16BPRIF_LENGTH               equ 0001h
TU16BCON1_TU16BPRIF_MASK                 equ 0004h
TU16BCON1_TU16BCAPT_POSN                 equ 0003h
TU16BCON1_TU16BCAPT_POSITION             equ 0003h
TU16BCON1_TU16BCAPT_SIZE                 equ 0001h
TU16BCON1_TU16BCAPT_LENGTH               equ 0001h
TU16BCON1_TU16BCAPT_MASK                 equ 0008h
TU16BCON1_TU16BLIMIT_POSN                equ 0004h
TU16BCON1_TU16BLIMIT_POSITION            equ 0004h
TU16BCON1_TU16BLIMIT_SIZE                equ 0001h
TU16BCON1_TU16BLIMIT_LENGTH              equ 0001h
TU16BCON1_TU16BLIMIT_MASK                equ 0010h
TU16BCON1_TU16BCLR_POSN                  equ 0005h
TU16BCON1_TU16BCLR_POSITION              equ 0005h
TU16BCON1_TU16BCLR_SIZE                  equ 0001h
TU16BCON1_TU16BCLR_LENGTH                equ 0001h
TU16BCON1_TU16BCLR_MASK                  equ 0020h
TU16BCON1_TMRBOSEN_POSN                  equ 0006h
TU16BCON1_TMRBOSEN_POSITION              equ 0006h
TU16BCON1_TMRBOSEN_SIZE                  equ 0001h
TU16BCON1_TMRBOSEN_LENGTH                equ 0001h
TU16BCON1_TMRBOSEN_MASK                  equ 0040h
TU16BCON1_TU16BRUN_POSN                  equ 0007h
TU16BCON1_TU16BRUN_POSITION              equ 0007h
TU16BCON1_TU16BRUN_SIZE                  equ 0001h
TU16BCON1_TU16BRUN_LENGTH                equ 0001h
TU16BCON1_TU16BRUN_MASK                  equ 0080h

