garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f56q24.inc
#define I2C1EIE                          BANKMASK(PIE7), 3, a
#define I2C1EIF                          BANKMASK(PIR7), 3, a
#define I2C1EIP                          BANKMASK(IPR7), 3, a
#define I2C1IE                           BANKMASK(PIE7), 2, a
#define I2C1IF                           BANKMASK(PIR7), 2, a
#define I2C1IP                           BANKMASK(IPR7), 2, a
#define I2C1MD                           BANKMASK(PMD3), 3, b
#define I2C1RXIE                         BANKMASK(PIE7), 0, a
#define I2C1RXIF                         BANKMASK(PIR7), 0, a
#define I2C1RXIP                         BANKMASK(IPR7), 0, a
#define I2C1SCLPPS0                      BANKMASK(I2C1SCLPPS), 0, b
#define I2C1SCLPPS1                      BANKMASK(I2C1SCLPPS), 1, b
#define I2C1SCLPPS2                      BANKMASK(I2C1SCLPPS), 2, b
#define I2C1SCLPPS3                      BANKMASK(I2C1SCLPPS), 3, b
#define I2C1SCLPPS4                      BANKMASK(I2C1SCLPPS), 4, b
#define I2C1SCLPPS5                      BANKMASK(I2C1SCLPPS), 5, b
#define I2C1SDAPPS0                      BANKMASK(I2C1SDAPPS), 0, b
#define I2C1SDAPPS1                      BANKMASK(I2C1SDAPPS), 1, b
#define I2C1SDAPPS2                      BANKMASK(I2C1SDAPPS), 2, b
#define I2C1SDAPPS3                      BANKMASK(I2C1SDAPPS), 3, b
#define I2C1SDAPPS4                      BANKMASK(I2C1SDAPPS), 4, b
#define I2C1SDAPPS5                      BANKMASK(I2C1SDAPPS), 5, b
#define I2C1TXIE                         BANKMASK(PIE7), 1, a
#define I2C1TXIF                         BANKMASK(PIR7), 1, a
#define I2C1TXIP                         BANKMASK(IPR7), 1, a
#define I2C2CNT0                         BANKMASK(I2C2CNTL), 0, b
#define I2C2CNT1                         BANKMASK(I2C2CNTL), 1, b
#define I2C2CNT10                        BANKMASK(I2C2CNTH), 2, b
#define I2C2CNT11                        BANKMASK(I2C2CNTH), 3, b
#define I2C2CNT12                        BANKMASK(I2C2CNTH), 4, b
#define I2C2CNT13                        BANKMASK(I2C2CNTH), 5, b
#define I2C2CNT14                        BANKMASK(I2C2CNTH), 6, b
#define I2C2CNT15                        BANKMASK(I2C2CNTH), 7, b
#define I2C2CNT2                         BANKMASK(I2C2CNTL), 2, b
#define I2C2CNT3                         BANKMASK(I2C2CNTL), 3, b
#define I2C2CNT4                         BANKMASK(I2C2CNTL), 4, b
#define I2C2CNT5                         BANKMASK(I2C2CNTL), 5, b
#define I2C2CNT6                         BANKMASK(I2C2CNTL), 6, b
#define I2C2CNT7                         BANKMASK(I2C2CNTL), 7, b
#define I2C2CNT8                         BANKMASK(I2C2CNTH), 0, b
#define I2C2CNT9                         BANKMASK(I2C2CNTH), 1, b
#define I2C2EIE                          BANKMASK(PIE1), 7, a
#define I2C2EIF                          BANKMASK(PIR1), 7, a
#define I2C2EIP                          BANKMASK(IPR1), 7, a
#define I2C2IE                           BANKMASK(PIE1), 6, a
#define I2C2IF                           BANKMASK(PIR1), 6, a
#define I2C2IP                           BANKMASK(IPR1), 6, a
#define I2C2MD                           BANKMASK(PMD4), 0, b
#define I2C2RXIE                         BANKMASK(PIE1), 4, a
#define I2C2RXIF                         BANKMASK(PIR1), 4, a
#define I2C2RXIP                         BANKMASK(IPR1), 4, a
#define I2C2SCLPPS0                      BANKMASK(I2C2SCLPPS), 0, b
#define I2C2SCLPPS1                      BANKMASK(I2C2SCLPPS), 1, b
#define I2C2SCLPPS2                      BANKMASK(I2C2SCLPPS), 2, b
#define I2C2SCLPPS3                      BANKMASK(I2C2SCLPPS), 3, b
#define I2C2SCLPPS4                      BANKMASK(I2C2SCLPPS), 4, b
#define I2C2SCLPPS5                      BANKMASK(I2C2SCLPPS), 5, b
#define I2C2SDAPPS0                      BANKMASK(I2C2SDAPPS), 0, b
#define I2C2SDAPPS1                      BANKMASK(I2C2SDAPPS), 1, b
#define I2C2SDAPPS2                      BANKMASK(I2C2SDAPPS), 2, b
#define I2C2SDAPPS3                      BANKMASK(I2C2SDAPPS), 3, b
#define I2C2SDAPPS4                      BANKMASK(I2C2SDAPPS), 4, b
#define I2C2SDAPPS5                      BANKMASK(I2C2SDAPPS), 5, b
#define I2C2TXIE                         BANKMASK(PIE1), 5, a
#define I2C2TXIF                         BANKMASK(PIR1), 5, a
#define I2C2TXIP                         BANKMASK(IPR1), 5, a
#define IDLEN                            BANKMASK(CPUDOZE), 7, a
#define IN                               BANKMASK(CWG1CON1), 5, b
#define INC0                             BANKMASK(NCO1INCL), 0, b
#define INC1                             BANKMASK(NCO1INCL), 1, b
#define INC10                            BANKMASK(NCO1INCH), 2, b
#define INC11                            BANKMASK(NCO1INCH), 3, b
#define INC12                            BANKMASK(NCO1INCH), 4, b
#define INC13                            BANKMASK(NCO1INCH), 5, b
#define INC14                            BANKMASK(NCO1INCH), 6, b
#define INC15                            BANKMASK(NCO1INCH), 7, b
#define INC16                            BANKMASK(NCO1INCU), 0, b
#define INC17                            BANKMASK(NCO1INCU), 1, b
#define INC18                            BANKMASK(NCO1INCU), 2, b
#define INC19                            BANKMASK(NCO1INCU), 3, b
#define INC2                             BANKMASK(NCO1INCL), 2, b
#define INC3                             BANKMASK(NCO1INCL), 3, b
#define INC4                             BANKMASK(NCO1INCL), 4, b
#define INC5                             BANKMASK(NCO1INCL), 5, b
#define INC6                             BANKMASK(NCO1INCL), 6, b
#define INC7                             BANKMASK(NCO1INCL), 7, b
#define INC8                             BANKMASK(NCO1INCH), 0, b
#define INC9                             BANKMASK(NCO1INCH), 1, b
#define INLVLA0                          BANKMASK(INLVLA), 0, b
#define INLVLA1                          BANKMASK(INLVLA), 1, b
#define INLVLA2                          BANKMASK(INLVLA), 2, b
#define INLVLA3                          BANKMASK(INLVLA), 3, b
#define INLVLA4                          BANKMASK(INLVLA), 4, b
#define INLVLA5                          BANKMASK(INLVLA), 5, b
#define INLVLA6                          BANKMASK(INLVLA), 6, b
#define INLVLA7                          BANKMASK(INLVLA), 7, b
#define INLVLB0                          BANKMASK(INLVLB), 0, b
#define INLVLB1                          BANKMASK(INLVLB), 1, b
#define INLVLB2                          BANKMASK(INLVLB), 2, b
#define INLVLB3                          BANKMASK(INLVLB), 3, b
#define INLVLB4                          BANKMASK(INLVLB), 4, b
#define INLVLB5                          BANKMASK(INLVLB), 5, b
#define INLVLB6                          BANKMASK(INLVLB), 6, b
#define INLVLB7                          BANKMASK(INLVLB), 7, b
#define INLVLC0                          BANKMASK(INLVLC), 0, b
#define INLVLC1                          BANKMASK(INLVLC), 1, b
#define INLVLC2                          BANKMASK(INLVLC), 2, b
#define INLVLC3                          BANKMASK(INLVLC), 3, b
#define INLVLC4                          BANKMASK(INLVLC), 4, b
#define INLVLC5                          BANKMASK(INLVLC), 5, b
#define INLVLC6                          BANKMASK(INLVLC), 6, b
#define INLVLD0                          BANKMASK(INLVLD), 0, b
#define INLVLD1                          BANKMASK(INLVLD), 1, b
#define INLVLD2                          BANKMASK(INLVLD), 2, b
#define INLVLD3                          BANKMASK(INLVLD), 3, b
#define INLVLD4                          BANKMASK(INLVLD), 4, b
#define INLVLD5                          BANKMASK(INLVLD), 5, b
#define INLVLD6                          BANKMASK(INLVLD), 6, b
#define INLVLD7                          BANKMASK(INLVLD), 7, b
#define INLVLE0                          BANKMASK(INLVLE), 0, b
#define INLVLE1                          BANKMASK(INLVLE), 1, b
#define INLVLE2                          BANKMASK(INLVLE), 2, b
#define INLVLE3                          BANKMASK(INLVLE), 3, b
#define INLVLF0                          BANKMASK(INLVLF), 0, b
#define INLVLF1                          BANKMASK(INLVLF), 1, b
#define INLVLF2                          BANKMASK(INLVLF), 2, b
#define INLVLF3                          BANKMASK(INLVLF), 3, b
#define INLVLF4                          BANKMASK(INLVLF), 4, b
#define INLVLF5                          BANKMASK(INLVLF), 5, b
#define INLVLF6                          BANKMASK(INLVLF), 6, b
#define INLVLF7                          BANKMASK(INLVLF), 7, b
#define INT0EDG                          BANKMASK(INTCON0), 0, a
#define INT0IE                           BANKMASK(PIE1), 0, a
#define INT0IF                           BANKMASK(PIR1), 0, a
#define INT0IP                           BANKMASK(IPR1), 0, a
#define INT0PPS0                         BANKMASK(INT0PPS), 0, b
#define INT0PPS1                         BANKMASK(INT0PPS), 1, b
#define INT0PPS2                         BANKMASK(INT0PPS), 2, b
#define INT0PPS3                         BANKMASK(INT0PPS), 3, b
#define INT0PPS4                         BANKMASK(INT0PPS), 4, b
#define INT0PPS5                         BANKMASK(INT0PPS), 5, b
#define INT1EDG                          BANKMASK(INTCON0), 1, a
#define INT1IE                           BANKMASK(PIE6), 0, a
#define INT1IF                           BANKMASK(PIR6), 0, a
#define INT1IP                           BANKMASK(IPR6), 0, a
#define INT1PPS0                         BANKMASK(INT1PPS), 0, b
#define INT1PPS1                         BANKMASK(INT1PPS), 1, b
#define INT1PPS2                         BANKMASK(INT1PPS), 2, b
#define INT1PPS3                         BANKMASK(INT1PPS), 3, b
#define INT1PPS4                         BANKMASK(INT1PPS), 4, b
#define INT1PPS5                         BANKMASK(INT1PPS), 5, b
#define INT2EDG                          BANKMASK(INTCON0), 2, a
#define INT2IE                           BANKMASK(PIE10), 0, a
#define INT2IF                           BANKMASK(PIR10), 0, a
#define INT2IP                           BANKMASK(IPR10), 0, a
#define INT2PPS0                         BANKMASK(INT2PPS), 0, b
#define INT2PPS1                         BANKMASK(INT2PPS), 1, b
#define INT2PPS2                         BANKMASK(INT2PPS), 2, b
#define INT2PPS3                         BANKMASK(INT2PPS), 3, b
#define INT2PPS4                         BANKMASK(INT2PPS), 4, b
#define INT2PPS5                         BANKMASK(INT2PPS), 5, b
#define INTH                             BANKMASK(HLVDCON0), 1, b
#define INTL                             BANKMASK(HLVDCON0), 0, b
#define IOCAF0                           BANKMASK(IOCAF), 0, b
#define IOCAF1                           BANKMASK(IOCAF), 1, b
#define IOCAF2                           BANKMASK(IOCAF), 2, b
#define IOCAF3                           BANKMASK(IOCAF), 3, b
#define IOCAF4                           BANKMASK(IOCAF), 4, b
#define IOCAF5                           BANKMASK(IOCAF), 5, b
#define IOCAF6                           BANKMASK(IOCAF), 6, b
#define IOCAF7                           BANKMASK(IOCAF), 7, b
#define IOCAN0                           BANKMASK(IOCAN), 0, b
#define IOCAN1                           BANKMASK(IOCAN), 1, b
#define IOCAN2                           BANKMASK(IOCAN), 2, b
#define IOCAN3                           BANKMASK(IOCAN), 3, b
#define IOCAN4                           BANKMASK(IOCAN), 4, b
#define IOCAN5                           BANKMASK(IOCAN), 5, b
#define IOCAN6                           BANKMASK(IOCAN), 6, b
#define IOCAN7                           BANKMASK(IOCAN), 7, b
#define IOCAP0                           BANKMASK(IOCAP), 0, b
#define IOCAP1                           BANKMASK(IOCAP), 1, b
#define IOCAP2                           BANKMASK(IOCAP), 2, b
#define IOCAP3                           BANKMASK(IOCAP), 3, b
#define IOCAP4                           BANKMASK(IOCAP), 4, b
#define IOCAP5                           BANKMASK(IOCAP), 5, b
#define IOCAP6                           BANKMASK(IOCAP), 6, b
#define IOCAP7                           BANKMASK(IOCAP), 7, b
#define IOCBF0                           BANKMASK(IOCBF), 0, b
#define IOCBF1                           BANKMASK(IOCBF), 1, b
#define IOCBF2                           BANKMASK(IOCBF), 2, b
#define IOCBF3                           BANKMASK(IOCBF), 3, b
#define IOCBF4                           BANKMASK(IOCBF), 4, b
#define IOCBF5                           BANKMASK(IOCBF), 5, b
#define IOCBF6                           BANKMASK(IOCBF), 6, b
#define IOCBF7                           BANKMASK(IOCBF), 7, b
#define IOCBN0                           BANKMASK(IOCBN), 0, b
#define IOCBN1                           BANKMASK(IOCBN), 1, b
#define IOCBN2                           BANKMASK(IOCBN), 2, b
#define IOCBN3                           BANKMASK(IOCBN), 3, b
#define IOCBN4                           BANKMASK(IOCBN), 4, b
#define IOCBN5                           BANKMASK(IOCBN), 5, b
#define IOCBN6                           BANKMASK(IOCBN), 6, b
#define IOCBN7                           BANKMASK(IOCBN), 7, b
#define IOCBP0                           BANKMASK(IOCBP), 0, b
#define IOCBP1                           BANKMASK(IOCBP), 1, b
#define IOCBP2                           BANKMASK(IOCBP), 2, b
#define IOCBP3                           BANKMASK(IOCBP), 3, b
#define IOCBP4                           BANKMASK(IOCBP), 4, b
#define IOCBP5                           BANKMASK(IOCBP), 5, b
#define IOCBP6                           BANKMASK(IOCBP), 6, b
#define IOCBP7                           BANKMASK(IOCBP), 7, b
#define IOCCF0                           BANKMASK(IOCCF), 0, b
#define IOCCF1                           BANKMASK(IOCCF), 1, b
#define IOCCF2                           BANKMASK(IOCCF), 2, b
#define IOCCF3                           BANKMASK(IOCCF), 3, b
#define IOCCF4                           BANKMASK(IOCCF), 4, b
#define IOCCF5                           BANKMASK(IOCCF), 5, b
#define IOCCF6                           BANKMASK(IOCCF), 6, b
#define IOCCN0                           BANKMASK(IOCCN), 0, b
#define IOCCN1                           BANKMASK(IOCCN), 1, b
#define IOCCN2                           BANKMASK(IOCCN), 2, b
#define IOCCN3                           BANKMASK(IOCCN), 3, b
#define IOCCN4                           BANKMASK(IOCCN), 4, b
#define IOCCN5                           BANKMASK(IOCCN), 5, b
#define IOCCN6                           BANKMASK(IOCCN), 6, b
#define IOCCP0                           BANKMASK(IOCCP), 0, b
#define IOCCP1                           BANKMASK(IOCCP), 1, b
#define IOCCP2                           BANKMASK(IOCCP), 2, b
#define IOCCP3                           BANKMASK(IOCCP), 3, b
#define IOCCP4                           BANKMASK(IOCCP), 4, b
#define IOCCP5                           BANKMASK(IOCCP), 5, b
#define IOCCP6                           BANKMASK(IOCCP), 6, b
#define IOCDF0                           BANKMASK(IOCDF), 0, b
#define IOCDF1                           BANKMASK(IOCDF), 1, b
#define IOCDF2                           BANKMASK(IOCDF), 2, b
#define IOCDF3                           BANKMASK(IOCDF), 3, b
#define IOCDF4                           BANKMASK(IOCDF), 4, b
#define IOCDF5                           BANKMASK(IOCDF), 5, b
#define IOCDF6                           BANKMASK(IOCDF), 6, b
#define IOCDF7                           BANKMASK(IOCDF), 7, b
#define IOCDN0                           BANKMASK(IOCDN), 0, b
#define IOCDN1                           BANKMASK(IOCDN), 1, b
#define IOCDN2                           BANKMASK(IOCDN), 2, b
#define IOCDN3                           BANKMASK(IOCDN), 3, b
#define IOCDN4                           BANKMASK(IOCDN), 4, b
#define IOCDN5                           BANKMASK(IOCDN), 5, b
#define IOCDN6                           BANKMASK(IOCDN), 6, b
#define IOCDN7                           BANKMASK(IOCDN), 7, b
#define IOCDP0                           BANKMASK(IOCDP), 0, b
#define IOCDP1                           BANKMASK(IOCDP), 1, b
#define IOCDP2                           BANKMASK(IOCDP), 2, b
#define IOCDP3                           BANKMASK(IOCDP), 3, b
#define IOCDP4                           BANKMASK(IOCDP), 4, b
#define IOCDP5                           BANKMASK(IOCDP), 5, b
#define IOCDP6                           BANKMASK(IOCDP), 6, b
#define IOCDP7                           BANKMASK(IOCDP), 7, b
#define IOCEF3                           BANKMASK(IOCEF), 3, b
#define IOCEN3                           BANKMASK(IOCEN), 3, b
#define IOCEP3                           BANKMASK(IOCEP), 3, b
#define IOCFF0                           BANKMASK(IOCFF), 0, b
#define IOCFF1                           BANKMASK(IOCFF), 1, b
#define IOCFF2                           BANKMASK(IOCFF), 2, b
#define IOCFF3                           BANKMASK(IOCFF), 3, b
#define IOCFF4                           BANKMASK(IOCFF), 4, b
#define IOCFF5                           BANKMASK(IOCFF), 5, b
#define IOCFF6                           BANKMASK(IOCFF), 6, b
#define IOCFF7                           BANKMASK(IOCFF), 7, b
#define IOCFN0                           BANKMASK(IOCFN), 0, b
#define IOCFN1                           BANKMASK(IOCFN), 1, b
#define IOCFN2                           BANKMASK(IOCFN), 2, b
#define IOCFN3                           BANKMASK(IOCFN), 3, b
#define IOCFN4                           BANKMASK(IOCFN), 4, b
#define IOCFN5                           BANKMASK(IOCFN), 5, b
#define IOCFN6                           BANKMASK(IOCFN), 6, b
#define IOCFN7                           BANKMASK(IOCFN), 7, b
#define IOCFP0                           BANKMASK(IOCFP), 0, b
#define IOCFP1                           BANKMASK(IOCFP), 1, b
#define IOCFP2                           BANKMASK(IOCFP), 2, b
#define IOCFP3                           BANKMASK(IOCFP), 3, b
#define IOCFP4                           BANKMASK(IOCFP), 4, b
#define IOCFP5                           BANKMASK(IOCFP), 5, b
#define IOCFP6                           BANKMASK(IOCFP), 6, b
#define IOCFP7                           BANKMASK(IOCFP), 7, b
#define IOCIE                            BANKMASK(PIE0), 7, a
#define IOCIF                            BANKMASK(PIR0), 7, a
#define IOCIP                            BANKMASK(IPR0), 7, a
#define IOCMD                            BANKMASK(PMD0), 0, b
#define IOCSRIE                          BANKMASK(PIE2), 2, a
#define IOCSRIF                          BANKMASK(PIR2), 2, a
#define IOCSRIP                          BANKMASK(IPR2), 2, a
#define IOCWF0                           BANKMASK(IOCWF), 0, b
#define IOCWF1                           BANKMASK(IOCWF), 1, b
#define IOCWF2                           BANKMASK(IOCWF), 2, b
#define IOCWF3                           BANKMASK(IOCWF), 3, b
#define IOCWF4                           BANKMASK(IOCWF), 4, b
#define IOCWF5                           BANKMASK(IOCWF), 5, b
#define IOCWF6                           BANKMASK(IOCWF), 6, b
#define IOCWF7                           BANKMASK(IOCWF), 7, b
#define IOCWN0                           BANKMASK(IOCWN), 0, b
#define IOCWN1                           BANKMASK(IOCWN), 1, b
#define IOCWN2                           BANKMASK(IOCWN), 2, b
#define IOCWN3                           BANKMASK(IOCWN), 3, b
#define IOCWN4                           BANKMASK(IOCWN), 4, b
#define IOCWN5                           BANKMASK(IOCWN), 5, b
#define IOCWN6                           BANKMASK(IOCWN), 6, b
#define IOCWN7                           BANKMASK(IOCWN), 7, b
#define IOCWP0                           BANKMASK(IOCWP), 0, b
#define IOCWP1                           BANKMASK(IOCWP), 1, b
#define IOCWP2                           BANKMASK(IOCWP), 2, b
#define IOCWP3                           BANKMASK(IOCWP), 3, b
#define IOCWP4                           BANKMASK(IOCWP), 4, b
#define IOCWP5                           BANKMASK(IOCWP), 5, b
#define IOCWP6                           BANKMASK(IOCWP), 6, b
#define IOCWP7                           BANKMASK(IOCWP), 7, b
#define ISM0                             BANKMASK(CWG1ISM), 0, b
#define ISM1                             BANKMASK(CWG1ISM), 1, b
#define ISM2                             BANKMASK(CWG1ISM), 2, b
#define ISM3                             BANKMASK(CWG1ISM), 3, b
#define ISM4                             BANKMASK(CWG1ISM), 4, b
#define ISRPR0                           BANKMASK(ISRPR), 0, b
#define ISRPR1                           BANKMASK(ISRPR), 1, b
#define ISRPR2                           BANKMASK(ISRPR), 2, b
#define IVTLOCKED                        BANKMASK(IVTLOCK), 0, b
#define LADR0                            BANKMASK(SCANLADRL), 0, b
#define LADR1                            BANKMASK(SCANLADRL), 1, b
#define LADR10                           BANKMASK(SCANLADRH), 2, b
#define LADR11                           BANKMASK(SCANLADRH), 3, b
#define LADR12                           BANKMASK(SCANLADRH), 4, b
#define LADR13                           BANKMASK(SCANLADRH), 5, b
#define LADR14                           BANKMASK(SCANLADRH), 6, b
#define LADR15                           BANKMASK(SCANLADRH), 7, b
#define LADR16                           BANKMASK(SCANLADRU), 0, b
#define LADR17                           BANKMASK(SCANLADRU), 1, b
#define LADR18                           BANKMASK(SCANLADRU), 2, b
#define LADR19                           BANKMASK(SCANLADRU), 3, b
#define LADR2                            BANKMASK(SCANLADRL), 2, b
#define LADR20                           BANKMASK(SCANLADRU), 4, b
#define LADR21                           BANKMASK(SCANLADRU), 5, b
#define LADR3                            BANKMASK(SCANLADRL), 3, b
#define LADR4                            BANKMASK(SCANLADRL), 4, b
#define LADR5                            BANKMASK(SCANLADRL), 5, b
#define LADR6                            BANKMASK(SCANLADRL), 6, b
#define LADR7                            BANKMASK(SCANLADRL), 7, b
#define LADR8                            BANKMASK(SCANLADRH), 0, b
#define LADR9                            BANKMASK(SCANLADRH), 1, b
#define LATA0                            BANKMASK(LATA), 0, b
#define LATA1                            BANKMASK(LATA), 1, b
#define LATA2                            BANKMASK(LATA), 2, b
#define LATA3                            BANKMASK(LATA), 3, b
#define LATA4                            BANKMASK(LATA), 4, b
#define LATA5                            BANKMASK(LATA), 5, b
#define LATA6                            BANKMASK(LATA), 6, b
#define LATA7                            BANKMASK(LATA), 7, b
#define LATB0                            BANKMASK(LATB), 0, b
#define LATB1                            BANKMASK(LATB), 1, b
#define LATB2                            BANKMASK(LATB), 2, b
#define LATB3                            BANKMASK(LATB), 3, b
#define LATB4                            BANKMASK(LATB), 4, b
#define LATB5                            BANKMASK(LATB), 5, b
#define LATB6                            BANKMASK(LATB), 6, b
#define LATB7                            BANKMASK(LATB), 7, b
#define LATC0                            BANKMASK(LATC), 0, b
#define LATC1                            BANKMASK(LATC), 1, b
#define LATC2                            BANKMASK(LATC), 2, b
#define LATC3                            BANKMASK(LATC), 3, b
#define LATC4                            BANKMASK(LATC), 4, b
#define LATC5                            BANKMASK(LATC), 5, b
#define LATC6                            BANKMASK(LATC), 6, b
#define LATD0                            BANKMASK(LATD), 0, b
#define LATD1                            BANKMASK(LATD), 1, b
#define LATD2                            BANKMASK(LATD), 2, b
#define LATD3                            BANKMASK(LATD), 3, b
#define LATD4                            BANKMASK(LATD), 4, b
#define LATD5                            BANKMASK(LATD), 5, b
#define LATD6                            BANKMASK(LATD), 6, b
