garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f56q24.inc
#define PSCNT5                           BANKMASK(WDTPSL), 5, b
#define PSCNT6                           BANKMASK(WDTPSL), 6, b
#define PSCNT7                           BANKMASK(WDTPSL), 7, b
#define PSCNT8                           BANKMASK(WDTPSH), 0, b
#define PSCNT9                           BANKMASK(WDTPSH), 1, b
#define PSIS                             BANKMASK(ADCON2), 7, b
#define PSS0                             BANKMASK(DAC1CON), 2, b
#define PSS1                             BANKMASK(DAC1CON), 3, b
#define PWDF0                            BANKMASK(PORTWDF), 0, b
#define PWDF1                            BANKMASK(PORTWDF), 1, b
#define PWDF2                            BANKMASK(PORTWDF), 2, b
#define PWDF3                            BANKMASK(PORTWDF), 3, b
#define PWDF4                            BANKMASK(PORTWDF), 4, b
#define PWDF5                            BANKMASK(PORTWDF), 5, b
#define PWDF6                            BANKMASK(PORTWDF), 6, b
#define PWDF7                            BANKMASK(PORTWDF), 7, b
#define PWM1ERSPPS0                      BANKMASK(PWM1ERSPPS), 0, b
#define PWM1ERSPPS1                      BANKMASK(PWM1ERSPPS), 1, b
#define PWM1ERSPPS2                      BANKMASK(PWM1ERSPPS), 2, b
#define PWM1ERSPPS3                      BANKMASK(PWM1ERSPPS), 3, b
#define PWM1ERSPPS4                      BANKMASK(PWM1ERSPPS), 4, b
#define PWM1ERSPPS5                      BANKMASK(PWM1ERSPPS), 5, b
#define PWM1IE                           BANKMASK(PIE4), 7, a
#define PWM1IF                           BANKMASK(PIR4), 7, a
#define PWM1IP                           BANKMASK(IPR4), 7, a
#define PWM1MD                           BANKMASK(PMD3), 0, b
#define PWM1PIE                          BANKMASK(PIE4), 6, a
#define PWM1PIF                          BANKMASK(PIR4), 6, a
#define PWM1PIP                          BANKMASK(IPR4), 6, a
#define PWM2ERSPPS0                      BANKMASK(PWM2ERSPPS), 0, b
#define PWM2ERSPPS1                      BANKMASK(PWM2ERSPPS), 1, b
#define PWM2ERSPPS2                      BANKMASK(PWM2ERSPPS), 2, b
#define PWM2ERSPPS3                      BANKMASK(PWM2ERSPPS), 3, b
#define PWM2ERSPPS4                      BANKMASK(PWM2ERSPPS), 4, b
#define PWM2ERSPPS5                      BANKMASK(PWM2ERSPPS), 5, b
#define PWM2IE                           BANKMASK(PIE5), 7, a
#define PWM2IF                           BANKMASK(PIR5), 7, a
#define PWM2IP                           BANKMASK(IPR5), 7, a
#define PWM2MD                           BANKMASK(PMD3), 1, b
#define PWM2PIE                          BANKMASK(PIE5), 6, a
#define PWM2PIF                          BANKMASK(PIR5), 6, a
#define PWM2PIP                          BANKMASK(IPR5), 6, a
#define PWM3ERSPPS0                      BANKMASK(PWM3ERSPPS), 0, b
#define PWM3ERSPPS1                      BANKMASK(PWM3ERSPPS), 1, b
#define PWM3ERSPPS2                      BANKMASK(PWM3ERSPPS), 2, b
#define PWM3ERSPPS3                      BANKMASK(PWM3ERSPPS), 3, b
#define PWM3ERSPPS4                      BANKMASK(PWM3ERSPPS), 4, b
#define PWM3ERSPPS5                      BANKMASK(PWM3ERSPPS), 5, b
#define PWM3IE                           BANKMASK(PIE7), 7, a
#define PWM3IF                           BANKMASK(PIR7), 7, a
#define PWM3IP                           BANKMASK(IPR7), 7, a
#define PWM3MD                           BANKMASK(PMD3), 2, b
#define PWM3PIE                          BANKMASK(PIE7), 6, a
#define PWM3PIF                          BANKMASK(PIR7), 6, a
#define PWM3PIP                          BANKMASK(IPR7), 6, a
#define PWMIN0PPS0                       BANKMASK(PWMIN0PPS), 0, b
#define PWMIN0PPS1                       BANKMASK(PWMIN0PPS), 1, b
#define PWMIN0PPS2                       BANKMASK(PWMIN0PPS), 2, b
#define PWMIN0PPS3                       BANKMASK(PWMIN0PPS), 3, b
#define PWMIN0PPS4                       BANKMASK(PWMIN0PPS), 4, b
#define PWMIN0PPS5                       BANKMASK(PWMIN0PPS), 5, b
#define PWMIN1PPS0                       BANKMASK(PWMIN1PPS), 0, b
#define PWMIN1PPS1                       BANKMASK(PWMIN1PPS), 1, b
#define PWMIN1PPS2                       BANKMASK(PWMIN1PPS), 2, b
#define PWMIN1PPS3                       BANKMASK(PWMIN1PPS), 3, b
#define PWMIN1PPS4                       BANKMASK(PWMIN1PPS), 4, b
#define PWMIN1PPS5                       BANKMASK(PWMIN1PPS), 5, b
#define PWS0                             BANKMASK(NCO1CLK), 5, b
#define PWS1                             BANKMASK(NCO1CLK), 6, b
#define PWS2                             BANKMASK(NCO1CLK), 7, b
#define RA0                              BANKMASK(PORTA), 0, b
#define RA0PPS0                          BANKMASK(RA0PPS), 0, b
#define RA0PPS1                          BANKMASK(RA0PPS), 1, b
#define RA0PPS2                          BANKMASK(RA0PPS), 2, b
#define RA0PPS3                          BANKMASK(RA0PPS), 3, b
#define RA0PPS4                          BANKMASK(RA0PPS), 4, b
#define RA0PPS5                          BANKMASK(RA0PPS), 5, b
#define RA1                              BANKMASK(PORTA), 1, b
#define RA1PPS0                          BANKMASK(RA1PPS), 0, b
#define RA1PPS1                          BANKMASK(RA1PPS), 1, b
#define RA1PPS2                          BANKMASK(RA1PPS), 2, b
#define RA1PPS3                          BANKMASK(RA1PPS), 3, b
#define RA1PPS4                          BANKMASK(RA1PPS), 4, b
#define RA1PPS5                          BANKMASK(RA1PPS), 5, b
#define RA2                              BANKMASK(PORTA), 2, b
#define RA2PPS0                          BANKMASK(RA2PPS), 0, b
#define RA2PPS1                          BANKMASK(RA2PPS), 1, b
#define RA2PPS2                          BANKMASK(RA2PPS), 2, b
#define RA2PPS3                          BANKMASK(RA2PPS), 3, b
#define RA2PPS4                          BANKMASK(RA2PPS), 4, b
#define RA2PPS5                          BANKMASK(RA2PPS), 5, b
#define RA3                              BANKMASK(PORTA), 3, b
#define RA3PPS0                          BANKMASK(RA3PPS), 0, b
#define RA3PPS1                          BANKMASK(RA3PPS), 1, b
#define RA3PPS2                          BANKMASK(RA3PPS), 2, b
#define RA3PPS3                          BANKMASK(RA3PPS), 3, b
#define RA3PPS4                          BANKMASK(RA3PPS), 4, b
#define RA3PPS5                          BANKMASK(RA3PPS), 5, b
#define RA4                              BANKMASK(PORTA), 4, b
#define RA4PPS0                          BANKMASK(RA4PPS), 0, b
#define RA4PPS1                          BANKMASK(RA4PPS), 1, b
#define RA4PPS2                          BANKMASK(RA4PPS), 2, b
#define RA4PPS3                          BANKMASK(RA4PPS), 3, b
#define RA4PPS4                          BANKMASK(RA4PPS), 4, b
#define RA4PPS5                          BANKMASK(RA4PPS), 5, b
#define RA5                              BANKMASK(PORTA), 5, b
#define RA5PPS0                          BANKMASK(RA5PPS), 0, b
#define RA5PPS1                          BANKMASK(RA5PPS), 1, b
#define RA5PPS2                          BANKMASK(RA5PPS), 2, b
#define RA5PPS3                          BANKMASK(RA5PPS), 3, b
#define RA5PPS4                          BANKMASK(RA5PPS), 4, b
#define RA5PPS5                          BANKMASK(RA5PPS), 5, b
#define RA6                              BANKMASK(PORTA), 6, b
#define RA6PPS0                          BANKMASK(RA6PPS), 0, b
#define RA6PPS1                          BANKMASK(RA6PPS), 1, b
#define RA6PPS2                          BANKMASK(RA6PPS), 2, b
#define RA6PPS3                          BANKMASK(RA6PPS), 3, b
#define RA6PPS4                          BANKMASK(RA6PPS), 4, b
#define RA6PPS5                          BANKMASK(RA6PPS), 5, b
#define RA7                              BANKMASK(PORTA), 7, b
#define RA7PPS0                          BANKMASK(RA7PPS), 0, b
#define RA7PPS1                          BANKMASK(RA7PPS), 1, b
#define RA7PPS2                          BANKMASK(RA7PPS), 2, b
#define RA7PPS3                          BANKMASK(RA7PPS), 3, b
#define RA7PPS4                          BANKMASK(RA7PPS), 4, b
#define RA7PPS5                          BANKMASK(RA7PPS), 5, b
#define RB0                              BANKMASK(PORTB), 0, b
#define RB0PPS0                          BANKMASK(RB0PPS), 0, b
#define RB0PPS1                          BANKMASK(RB0PPS), 1, b
#define RB0PPS2                          BANKMASK(RB0PPS), 2, b
#define RB0PPS3                          BANKMASK(RB0PPS), 3, b
#define RB0PPS4                          BANKMASK(RB0PPS), 4, b
#define RB0PPS5                          BANKMASK(RB0PPS), 5, b
#define RB1                              BANKMASK(PORTB), 1, b
#define RB1PPS0                          BANKMASK(RB1PPS), 0, b
#define RB1PPS1                          BANKMASK(RB1PPS), 1, b
#define RB1PPS2                          BANKMASK(RB1PPS), 2, b
#define RB1PPS3                          BANKMASK(RB1PPS), 3, b
#define RB1PPS4                          BANKMASK(RB1PPS), 4, b
#define RB1PPS5                          BANKMASK(RB1PPS), 5, b
#define RB2                              BANKMASK(PORTB), 2, b
#define RB2PPS0                          BANKMASK(RB2PPS), 0, b
#define RB2PPS1                          BANKMASK(RB2PPS), 1, b
#define RB2PPS2                          BANKMASK(RB2PPS), 2, b
#define RB2PPS3                          BANKMASK(RB2PPS), 3, b
#define RB2PPS4                          BANKMASK(RB2PPS), 4, b
#define RB2PPS5                          BANKMASK(RB2PPS), 5, b
#define RB3                              BANKMASK(PORTB), 3, b
#define RB3PPS0                          BANKMASK(RB3PPS), 0, b
#define RB3PPS1                          BANKMASK(RB3PPS), 1, b
#define RB3PPS2                          BANKMASK(RB3PPS), 2, b
#define RB3PPS3                          BANKMASK(RB3PPS), 3, b
#define RB3PPS4                          BANKMASK(RB3PPS), 4, b
#define RB3PPS5                          BANKMASK(RB3PPS), 5, b
#define RB4                              BANKMASK(PORTB), 4, b
#define RB4PPS0                          BANKMASK(RB4PPS), 0, b
#define RB4PPS1                          BANKMASK(RB4PPS), 1, b
#define RB4PPS2                          BANKMASK(RB4PPS), 2, b
#define RB4PPS3                          BANKMASK(RB4PPS), 3, b
#define RB4PPS4                          BANKMASK(RB4PPS), 4, b
#define RB4PPS5                          BANKMASK(RB4PPS), 5, b
#define RB5                              BANKMASK(PORTB), 5, b
#define RB5PPS0                          BANKMASK(RB5PPS), 0, b
#define RB5PPS1                          BANKMASK(RB5PPS), 1, b
#define RB5PPS2                          BANKMASK(RB5PPS), 2, b
#define RB5PPS3                          BANKMASK(RB5PPS), 3, b
#define RB5PPS4                          BANKMASK(RB5PPS), 4, b
#define RB5PPS5                          BANKMASK(RB5PPS), 5, b
#define RB6                              BANKMASK(PORTB), 6, b
#define RB6PPS0                          BANKMASK(RB6PPS), 0, b
#define RB6PPS1                          BANKMASK(RB6PPS), 1, b
#define RB6PPS2                          BANKMASK(RB6PPS), 2, b
#define RB6PPS3                          BANKMASK(RB6PPS), 3, b
#define RB6PPS4                          BANKMASK(RB6PPS), 4, b
#define RB6PPS5                          BANKMASK(RB6PPS), 5, b
#define RB7                              BANKMASK(PORTB), 7, b
#define RB7PPS0                          BANKMASK(RB7PPS), 0, b
#define RB7PPS1                          BANKMASK(RB7PPS), 1, b
#define RB7PPS2                          BANKMASK(RB7PPS), 2, b
#define RB7PPS3                          BANKMASK(RB7PPS), 3, b
#define RB7PPS4                          BANKMASK(RB7PPS), 4, b
#define RB7PPS5                          BANKMASK(RB7PPS), 5, b
#define RC0                              BANKMASK(PORTC), 0, b
#define RC0PPS0                          BANKMASK(RC0PPS), 0, b
#define RC0PPS1                          BANKMASK(RC0PPS), 1, b
#define RC0PPS2                          BANKMASK(RC0PPS), 2, b
#define RC0PPS3                          BANKMASK(RC0PPS), 3, b
#define RC0PPS4                          BANKMASK(RC0PPS), 4, b
#define RC0PPS5                          BANKMASK(RC0PPS), 5, b
#define RC1                              BANKMASK(PORTC), 1, b
#define RC1PPS0                          BANKMASK(RC1PPS), 0, b
#define RC1PPS1                          BANKMASK(RC1PPS), 1, b
#define RC1PPS2                          BANKMASK(RC1PPS), 2, b
#define RC1PPS3                          BANKMASK(RC1PPS), 3, b
#define RC1PPS4                          BANKMASK(RC1PPS), 4, b
#define RC1PPS5                          BANKMASK(RC1PPS), 5, b
#define RC2                              BANKMASK(PORTC), 2, b
#define RC2PPS0                          BANKMASK(RC2PPS), 0, b
#define RC2PPS1                          BANKMASK(RC2PPS), 1, b
#define RC2PPS2                          BANKMASK(RC2PPS), 2, b
#define RC2PPS3                          BANKMASK(RC2PPS), 3, b
#define RC2PPS4                          BANKMASK(RC2PPS), 4, b
#define RC2PPS5                          BANKMASK(RC2PPS), 5, b
#define RC3                              BANKMASK(PORTC), 3, b
#define RC3PPS0                          BANKMASK(RC3PPS), 0, b
#define RC3PPS1                          BANKMASK(RC3PPS), 1, b
#define RC3PPS2                          BANKMASK(RC3PPS), 2, b
#define RC3PPS3                          BANKMASK(RC3PPS), 3, b
#define RC3PPS4                          BANKMASK(RC3PPS), 4, b
#define RC3PPS5                          BANKMASK(RC3PPS), 5, b
#define RC4                              BANKMASK(PORTC), 4, b
#define RC4PPS0                          BANKMASK(RC4PPS), 0, b
#define RC4PPS1                          BANKMASK(RC4PPS), 1, b
#define RC4PPS2                          BANKMASK(RC4PPS), 2, b
#define RC4PPS3                          BANKMASK(RC4PPS), 3, b
#define RC4PPS4                          BANKMASK(RC4PPS), 4, b
#define RC4PPS5                          BANKMASK(RC4PPS), 5, b
#define RC5                              BANKMASK(PORTC), 5, b
#define RC5PPS0                          BANKMASK(RC5PPS), 0, b
#define RC5PPS1                          BANKMASK(RC5PPS), 1, b
#define RC5PPS2                          BANKMASK(RC5PPS), 2, b
#define RC5PPS3                          BANKMASK(RC5PPS), 3, b
#define RC5PPS4                          BANKMASK(RC5PPS), 4, b
#define RC5PPS5                          BANKMASK(RC5PPS), 5, b
#define RC6                              BANKMASK(PORTC), 6, b
#define RC6PPS0                          BANKMASK(RC6PPS), 0, b
#define RC6PPS1                          BANKMASK(RC6PPS), 1, b
#define RC6PPS2                          BANKMASK(RC6PPS), 2, b
#define RC6PPS3                          BANKMASK(RC6PPS), 3, b
#define RC6PPS4                          BANKMASK(RC6PPS), 4, b
#define RC6PPS5                          BANKMASK(RC6PPS), 5, b
#define RD0                              BANKMASK(PORTD), 0, b
#define RD0PPS0                          BANKMASK(RD0PPS), 0, b
#define RD0PPS1                          BANKMASK(RD0PPS), 1, b
#define RD0PPS2                          BANKMASK(RD0PPS), 2, b
#define RD0PPS3                          BANKMASK(RD0PPS), 3, b
#define RD0PPS4                          BANKMASK(RD0PPS), 4, b
#define RD0PPS5                          BANKMASK(RD0PPS), 5, b
#define RD1                              BANKMASK(PORTD), 1, b
#define RD161                            BANKMASK(T1CON), 1, b
#define RD163                            BANKMASK(T3CON), 1, b
#define RD1PPS0                          BANKMASK(RD1PPS), 0, b
#define RD1PPS1                          BANKMASK(RD1PPS), 1, b
#define RD1PPS2                          BANKMASK(RD1PPS), 2, b
#define RD1PPS3                          BANKMASK(RD1PPS), 3, b
#define RD1PPS4                          BANKMASK(RD1PPS), 4, b
#define RD1PPS5                          BANKMASK(RD1PPS), 5, b
#define RD2                              BANKMASK(PORTD), 2, b
#define RD2PPS0                          BANKMASK(RD2PPS), 0, b
#define RD2PPS1                          BANKMASK(RD2PPS), 1, b
#define RD2PPS2                          BANKMASK(RD2PPS), 2, b
#define RD2PPS3                          BANKMASK(RD2PPS), 3, b
#define RD2PPS4                          BANKMASK(RD2PPS), 4, b
#define RD2PPS5                          BANKMASK(RD2PPS), 5, b
#define RD3                              BANKMASK(PORTD), 3, b
#define RD3PPS0                          BANKMASK(RD3PPS), 0, b
#define RD3PPS1                          BANKMASK(RD3PPS), 1, b
#define RD3PPS2                          BANKMASK(RD3PPS), 2, b
#define RD3PPS3                          BANKMASK(RD3PPS), 3, b
#define RD3PPS4                          BANKMASK(RD3PPS), 4, b
#define RD3PPS5                          BANKMASK(RD3PPS), 5, b
#define RD4                              BANKMASK(PORTD), 4, b
#define RD4PPS0                          BANKMASK(RD4PPS), 0, b
#define RD4PPS1                          BANKMASK(RD4PPS), 1, b
#define RD4PPS2                          BANKMASK(RD4PPS), 2, b
#define RD4PPS3                          BANKMASK(RD4PPS), 3, b
#define RD4PPS4                          BANKMASK(RD4PPS), 4, b
#define RD4PPS5                          BANKMASK(RD4PPS), 5, b
#define RD5                              BANKMASK(PORTD), 5, b
#define RD5PPS0                          BANKMASK(RD5PPS), 0, b
#define RD5PPS1                          BANKMASK(RD5PPS), 1, b
#define RD5PPS2                          BANKMASK(RD5PPS), 2, b
#define RD5PPS3                          BANKMASK(RD5PPS), 3, b
#define RD5PPS4                          BANKMASK(RD5PPS), 4, b
#define RD5PPS5                          BANKMASK(RD5PPS), 5, b
#define RD6                              BANKMASK(PORTD), 6, b
#define RD6PPS0                          BANKMASK(RD6PPS), 0, b
#define RD6PPS1                          BANKMASK(RD6PPS), 1, b
#define RD6PPS2                          BANKMASK(RD6PPS), 2, b
#define RD6PPS3                          BANKMASK(RD6PPS), 3, b
#define RD6PPS4                          BANKMASK(RD6PPS), 4, b
#define RD6PPS5                          BANKMASK(RD6PPS), 5, b
#define RD7                              BANKMASK(PORTD), 7, b
#define RD7PPS0                          BANKMASK(RD7PPS), 0, b
#define RD7PPS1                          BANKMASK(RD7PPS), 1, b
#define RD7PPS2                          BANKMASK(RD7PPS), 2, b
#define RD7PPS3                          BANKMASK(RD7PPS), 3, b
#define RD7PPS4                          BANKMASK(RD7PPS), 4, b
#define RD7PPS5                          BANKMASK(RD7PPS), 5, b
#define RE0                              BANKMASK(PORTE), 0, b
#define RE0PPS0                          BANKMASK(RE0PPS), 0, b
#define RE0PPS1                          BANKMASK(RE0PPS), 1, b
#define RE0PPS2                          BANKMASK(RE0PPS), 2, b
#define RE0PPS3                          BANKMASK(RE0PPS), 3, b
#define RE0PPS4                          BANKMASK(RE0PPS), 4, b
#define RE0PPS5                          BANKMASK(RE0PPS), 5, b
#define RE1                              BANKMASK(PORTE), 1, b
#define RE1PPS0                          BANKMASK(RE1PPS), 0, b
#define RE1PPS1                          BANKMASK(RE1PPS), 1, b
#define RE1PPS2                          BANKMASK(RE1PPS), 2, b
#define RE1PPS3                          BANKMASK(RE1PPS), 3, b
#define RE1PPS4                          BANKMASK(RE1PPS), 4, b
#define RE1PPS5                          BANKMASK(RE1PPS), 5, b
#define RE2                              BANKMASK(PORTE), 2, b
#define RE2PPS0                          BANKMASK(RE2PPS), 0, b
#define RE2PPS1                          BANKMASK(RE2PPS), 1, b
#define RE2PPS2                          BANKMASK(RE2PPS), 2, b
#define RE2PPS3                          BANKMASK(RE2PPS), 3, b
#define RE2PPS4                          BANKMASK(RE2PPS), 4, b
#define RE2PPS5                          BANKMASK(RE2PPS), 5, b
#define RE3                              BANKMASK(PORTE), 3, b
#define REN                              BANKMASK(CWG1AS0), 6, b
#define RES0                             BANKMASK(ADRESL), 0, b
#define RES1                             BANKMASK(ADRESL), 1, b
#define RES10                            BANKMASK(ADRESH), 2, b
#define RES11                            BANKMASK(ADRESH), 3, b
#define RES12                            BANKMASK(ADRESH), 4, b
#define RES13                            BANKMASK(ADRESH), 5, b
#define RES14                            BANKMASK(ADRESH), 6, b
#define RES15                            BANKMASK(ADRESH), 7, b
#define RES2                             BANKMASK(ADRESL), 2, b
#define RES3                             BANKMASK(ADRESL), 3, b
#define RES4                             BANKMASK(ADRESL), 4, b
#define RES5                             BANKMASK(ADRESL), 5, b
#define RES6                             BANKMASK(ADRESL), 6, b
#define RES7                             BANKMASK(ADRESL), 7, b
#define RES8                             BANKMASK(ADRESH), 0, b
#define RES9                             BANKMASK(ADRESH), 1, b
#define RF0                              BANKMASK(PORTF), 0, b
#define RF0PPS0                          BANKMASK(RF0PPS), 0, b
#define RF0PPS1                          BANKMASK(RF0PPS), 1, b
#define RF0PPS2                          BANKMASK(RF0PPS), 2, b
#define RF0PPS3                          BANKMASK(RF0PPS), 3, b
#define RF0PPS4                          BANKMASK(RF0PPS), 4, b
#define RF0PPS5                          BANKMASK(RF0PPS), 5, b
#define RF1                              BANKMASK(PORTF), 1, b
#define RF1PPS0                          BANKMASK(RF1PPS), 0, b
#define RF1PPS1                          BANKMASK(RF1PPS), 1, b
#define RF1PPS2                          BANKMASK(RF1PPS), 2, b
#define RF1PPS3                          BANKMASK(RF1PPS), 3, b
#define RF1PPS4                          BANKMASK(RF1PPS), 4, b
#define RF1PPS5                          BANKMASK(RF1PPS), 5, b
#define RF2                              BANKMASK(PORTF), 2, b
#define RF2PPS0                          BANKMASK(RF2PPS), 0, b
#define RF2PPS1                          BANKMASK(RF2PPS), 1, b
#define RF2PPS2                          BANKMASK(RF2PPS), 2, b
#define RF2PPS3                          BANKMASK(RF2PPS), 3, b
#define RF2PPS4                          BANKMASK(RF2PPS), 4, b
#define RF2PPS5                          BANKMASK(RF2PPS), 5, b
#define RF3                              BANKMASK(PORTF), 3, b
#define RF3PPS0                          BANKMASK(RF3PPS), 0, b
#define RF3PPS1                          BANKMASK(RF3PPS), 1, b
#define RF3PPS2                          BANKMASK(RF3PPS), 2, b
#define RF3PPS3                          BANKMASK(RF3PPS), 3, b
#define RF3PPS4                          BANKMASK(RF3PPS), 4, b
#define RF3PPS5                          BANKMASK(RF3PPS), 5, b
#define RF4                              BANKMASK(PORTF), 4, b
#define RF4PPS0                          BANKMASK(RF4PPS), 0, b
#define RF4PPS1                          BANKMASK(RF4PPS), 1, b
#define RF4PPS2                          BANKMASK(RF4PPS), 2, b
#define RF4PPS3                          BANKMASK(RF4PPS), 3, b
#define RF4PPS4                          BANKMASK(RF4PPS), 4, b
#define RF4PPS5                          BANKMASK(RF4PPS), 5, b
#define RF5                              BANKMASK(PORTF), 5, b
#define RF5PPS0                          BANKMASK(RF5PPS), 0, b
#define RF5PPS1                          BANKMASK(RF5PPS), 1, b
#define RF5PPS2                          BANKMASK(RF5PPS), 2, b
#define RF5PPS3                          BANKMASK(RF5PPS), 3, b
#define RF5PPS4                          BANKMASK(RF5PPS), 4, b
#define RF5PPS5                          BANKMASK(RF5PPS), 5, b
#define RF6                              BANKMASK(PORTF), 6, b
#define RF6PPS0                          BANKMASK(RF6PPS), 0, b
#define RF6PPS1                          BANKMASK(RF6PPS), 1, b
#define RF6PPS2                          BANKMASK(RF6PPS), 2, b
