garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f56q24.inc
#define RF6PPS3                          BANKMASK(RF6PPS), 3, b
#define RF6PPS4                          BANKMASK(RF6PPS), 4, b
#define RF6PPS5                          BANKMASK(RF6PPS), 5, b
#define RF7                              BANKMASK(PORTF), 7, b
#define RF7PPS0                          BANKMASK(RF7PPS), 0, b
#define RF7PPS1                          BANKMASK(RF7PPS), 1, b
#define RF7PPS2                          BANKMASK(RF7PPS), 2, b
#define RF7PPS3                          BANKMASK(RF7PPS), 3, b
#define RF7PPS4                          BANKMASK(RF7PPS), 4, b
#define RF7PPS5                          BANKMASK(RF7PPS), 5, b
#define RI                               BANKMASK(PCON0), 2, a
#define RMCLR                            BANKMASK(PCON0), 3, a
#define ROI                              BANKMASK(CPUDOZE), 5, a
#define RPT0                             BANKMASK(ADRPT), 0, b
#define RPT1                             BANKMASK(ADRPT), 1, b
#define RPT2                             BANKMASK(ADRPT), 2, b
#define RPT3                             BANKMASK(ADRPT), 3, b
#define RPT4                             BANKMASK(ADRPT), 4, b
#define RPT5                             BANKMASK(ADRPT), 5, b
#define RPT6                             BANKMASK(ADRPT), 6, b
#define RPT7                             BANKMASK(ADRPT), 7, b
#define RSC1IE                           BANKMASK(I2C1PIE), 1, b
#define RSC1IF                           BANKMASK(I2C1PIR), 1, b
#define RSC2IE                           BANKMASK(I2C2PIE), 1, b
#define RSC2IF                           BANKMASK(I2C2PIR), 1, b
#define RW0                              BANKMASK(PORTW), 0, b
#define RW1                              BANKMASK(PORTW), 1, b
#define RW2                              BANKMASK(PORTW), 2, b
#define RW3                              BANKMASK(PORTW), 3, b
#define RW4                              BANKMASK(PORTW), 4, b
#define RW5                              BANKMASK(PORTW), 5, b
#define RW6                              BANKMASK(PORTW), 6, b
#define RW7                              BANKMASK(PORTW), 7, b
#define RWDT                             BANKMASK(PCON0), 4, a
#define SBOREN                           BANKMASK(BORCON), 7, b
#define SC1IE                            BANKMASK(I2C1PIE), 0, b
#define SC1IF                            BANKMASK(I2C1PIR), 0, b
#define SC2IE                            BANKMASK(I2C2PIE), 0, b
#define SC2IF                            BANKMASK(I2C2PIR), 0, b
#define SCANEN                           BANKMASK(SCANCON0), 7, b
#define SCANHADR0                        BANKMASK(SCANHADRL), 0, b
#define SCANHADR1                        BANKMASK(SCANHADRL), 1, b
#define SCANHADR10                       BANKMASK(SCANHADRH), 2, b
#define SCANHADR11                       BANKMASK(SCANHADRH), 3, b
#define SCANHADR12                       BANKMASK(SCANHADRH), 4, b
#define SCANHADR13                       BANKMASK(SCANHADRH), 5, b
#define SCANHADR14                       BANKMASK(SCANHADRH), 6, b
#define SCANHADR15                       BANKMASK(SCANHADRH), 7, b
#define SCANHADR16                       BANKMASK(SCANHADRU), 0, b
#define SCANHADR17                       BANKMASK(SCANHADRU), 1, b
#define SCANHADR18                       BANKMASK(SCANHADRU), 2, b
#define SCANHADR19                       BANKMASK(SCANHADRU), 3, b
#define SCANHADR2                        BANKMASK(SCANHADRL), 2, b
#define SCANHADR20                       BANKMASK(SCANHADRU), 4, b
#define SCANHADR21                       BANKMASK(SCANHADRU), 5, b
#define SCANHADR3                        BANKMASK(SCANHADRL), 3, b
#define SCANHADR4                        BANKMASK(SCANHADRL), 4, b
#define SCANHADR5                        BANKMASK(SCANHADRL), 5, b
#define SCANHADR6                        BANKMASK(SCANHADRL), 6, b
#define SCANHADR7                        BANKMASK(SCANHADRL), 7, b
#define SCANHADR8                        BANKMASK(SCANHADRH), 0, b
#define SCANHADR9                        BANKMASK(SCANHADRH), 1, b
#define SCANIE                           BANKMASK(PIE8), 7, a
#define SCANIF                           BANKMASK(PIR8), 7, a
#define SCANIP                           BANKMASK(IPR8), 7, a
#define SCANLADR0                        BANKMASK(SCANLADRL), 0, b
#define SCANLADR1                        BANKMASK(SCANLADRL), 1, b
#define SCANLADR10                       BANKMASK(SCANLADRH), 2, b
#define SCANLADR11                       BANKMASK(SCANLADRH), 3, b
#define SCANLADR12                       BANKMASK(SCANLADRH), 4, b
#define SCANLADR13                       BANKMASK(SCANLADRH), 5, b
#define SCANLADR14                       BANKMASK(SCANLADRH), 6, b
#define SCANLADR15                       BANKMASK(SCANLADRH), 7, b
#define SCANLADR16                       BANKMASK(SCANLADRU), 0, b
#define SCANLADR17                       BANKMASK(SCANLADRU), 1, b
#define SCANLADR18                       BANKMASK(SCANLADRU), 2, b
#define SCANLADR19                       BANKMASK(SCANLADRU), 3, b
#define SCANLADR2                        BANKMASK(SCANLADRL), 2, b
#define SCANLADR20                       BANKMASK(SCANLADRU), 4, b
#define SCANLADR21                       BANKMASK(SCANLADRU), 5, b
#define SCANLADR3                        BANKMASK(SCANLADRL), 3, b
#define SCANLADR4                        BANKMASK(SCANLADRL), 4, b
#define SCANLADR5                        BANKMASK(SCANLADRL), 5, b
#define SCANLADR6                        BANKMASK(SCANLADRL), 6, b
#define SCANLADR7                        BANKMASK(SCANLADRL), 7, b
#define SCANLADR8                        BANKMASK(SCANLADRH), 0, b
#define SCANLADR9                        BANKMASK(SCANLADRH), 1, b
#define SCANMD                           BANKMASK(PMD0), 3, b
#define SCANPR0                          BANKMASK(SCANPR), 0, b
#define SCANPR1                          BANKMASK(SCANPR), 1, b
#define SCANPR2                          BANKMASK(SCANPR), 2, b
#define SCNT0                            BANKMASK(DMAnSCNTL), 0, b
#define SCNT1                            BANKMASK(DMAnSCNTL), 1, b
#define SCNT10                           BANKMASK(DMAnSCNTH), 2, b
#define SCNT11                           BANKMASK(DMAnSCNTH), 3, b
#define SCNT2                            BANKMASK(DMAnSCNTL), 2, b
#define SCNT3                            BANKMASK(DMAnSCNTL), 3, b
#define SCNT4                            BANKMASK(DMAnSCNTL), 4, b
#define SCNT5                            BANKMASK(DMAnSCNTL), 5, b
#define SCNT6                            BANKMASK(DMAnSCNTL), 6, b
#define SCNT7                            BANKMASK(DMAnSCNTL), 7, b
#define SCNT8                            BANKMASK(DMAnSCNTH), 0, b
#define SCNT9                            BANKMASK(DMAnSCNTH), 1, b
#define SEN                              BANKMASK(WDTCON0), 0, b
#define SETUP0                           BANKMASK(CRCCON0), 2, b
#define SETUP1                           BANKMASK(CRCCON0), 3, b
#define SGO                              BANKMASK(SCANCON0), 5, b
#define SHADLO                           BANKMASK(SHADCON), 0, b
#define SHIFT0                           BANKMASK(CRCSHFTL), 0, b
#define SHIFT1                           BANKMASK(CRCSHFTL), 1, b
#define SHIFT10                          BANKMASK(CRCSHFTH), 2, b
#define SHIFT11                          BANKMASK(CRCSHFTH), 3, b
#define SHIFT12                          BANKMASK(CRCSHFTH), 4, b
#define SHIFT13                          BANKMASK(CRCSHFTH), 5, b
#define SHIFT14                          BANKMASK(CRCSHFTH), 6, b
#define SHIFT15                          BANKMASK(CRCSHFTH), 7, b
#define SHIFT16                          BANKMASK(CRCSHFTU), 0, b
#define SHIFT17                          BANKMASK(CRCSHFTU), 1, b
#define SHIFT18                          BANKMASK(CRCSHFTU), 2, b
#define SHIFT19                          BANKMASK(CRCSHFTU), 3, b
#define SHIFT2                           BANKMASK(CRCSHFTL), 2, b
#define SHIFT20                          BANKMASK(CRCSHFTU), 4, b
#define SHIFT21                          BANKMASK(CRCSHFTU), 5, b
#define SHIFT22                          BANKMASK(CRCSHFTU), 6, b
#define SHIFT23                          BANKMASK(CRCSHFTU), 7, b
#define SHIFT24                          BANKMASK(CRCSHFTT), 0, b
#define SHIFT25                          BANKMASK(CRCSHFTT), 1, b
#define SHIFT26                          BANKMASK(CRCSHFTT), 2, b
#define SHIFT27                          BANKMASK(CRCSHFTT), 3, b
#define SHIFT28                          BANKMASK(CRCSHFTT), 4, b
#define SHIFT29                          BANKMASK(CRCSHFTT), 5, b
#define SHIFT3                           BANKMASK(CRCSHFTL), 3, b
#define SHIFT30                          BANKMASK(CRCSHFTT), 6, b
#define SHIFT31                          BANKMASK(CRCSHFTT), 7, b
#define SHIFT4                           BANKMASK(CRCSHFTL), 4, b
#define SHIFT5                           BANKMASK(CRCSHFTL), 5, b
#define SHIFT6                           BANKMASK(CRCSHFTL), 6, b
#define SHIFT7                           BANKMASK(CRCSHFTL), 7, b
#define SHIFT8                           BANKMASK(CRCSHFTH), 0, b
#define SHIFT9                           BANKMASK(CRCSHFTH), 1, b
#define SHIFTM                           BANKMASK(CRCCON0), 1, b
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7, b
#define SIRQ0                            BANKMASK(DMAnSIRQ), 0, b
#define SIRQ1                            BANKMASK(DMAnSIRQ), 1, b
#define SIRQ2                            BANKMASK(DMAnSIRQ), 2, b
#define SIRQ3                            BANKMASK(DMAnSIRQ), 3, b
#define SIRQ4                            BANKMASK(DMAnSIRQ), 4, b
#define SIRQ5                            BANKMASK(DMAnSIRQ), 5, b
#define SIRQ6                            BANKMASK(DMAnSIRQ), 6, b
#define SIRQ7                            BANKMASK(DMAnSIRQ), 7, b
#define SIRQEN                           BANKMASK(DMAnCON0), 6, b
#define SLCT2                            BANKMASK(CLCSELECT), 2, b
#define SLRA0                            BANKMASK(SLRCONA), 0, b
#define SLRA1                            BANKMASK(SLRCONA), 1, b
#define SLRA2                            BANKMASK(SLRCONA), 2, b
#define SLRA3                            BANKMASK(SLRCONA), 3, b
#define SLRA4                            BANKMASK(SLRCONA), 4, b
#define SLRA5                            BANKMASK(SLRCONA), 5, b
#define SLRA6                            BANKMASK(SLRCONA), 6, b
#define SLRA7                            BANKMASK(SLRCONA), 7, b
#define SLRB0                            BANKMASK(SLRCONB), 0, b
#define SLRB1                            BANKMASK(SLRCONB), 1, b
#define SLRB2                            BANKMASK(SLRCONB), 2, b
#define SLRB3                            BANKMASK(SLRCONB), 3, b
#define SLRB4                            BANKMASK(SLRCONB), 4, b
#define SLRB5                            BANKMASK(SLRCONB), 5, b
#define SLRB6                            BANKMASK(SLRCONB), 6, b
#define SLRB7                            BANKMASK(SLRCONB), 7, b
#define SLRC0                            BANKMASK(SLRCONC), 0, b
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC2                            BANKMASK(SLRCONC), 2, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRD0                            BANKMASK(SLRCOND), 0, b
#define SLRD1                            BANKMASK(SLRCOND), 1, b
#define SLRD2                            BANKMASK(SLRCOND), 2, b
#define SLRD3                            BANKMASK(SLRCOND), 3, b
#define SLRD4                            BANKMASK(SLRCOND), 4, b
#define SLRD5                            BANKMASK(SLRCOND), 5, b
#define SLRD6                            BANKMASK(SLRCOND), 6, b
#define SLRD7                            BANKMASK(SLRCOND), 7, b
#define SLRE0                            BANKMASK(SLRCONE), 0, b
#define SLRE1                            BANKMASK(SLRCONE), 1, b
#define SLRE2                            BANKMASK(SLRCONE), 2, b
#define SLRF0                            BANKMASK(SLRCONF), 0, b
#define SLRF1                            BANKMASK(SLRCONF), 1, b
#define SLRF2                            BANKMASK(SLRCONF), 2, b
#define SLRF3                            BANKMASK(SLRCONF), 3, b
#define SLRF4                            BANKMASK(SLRCONF), 4, b
#define SLRF5                            BANKMASK(SLRCONF), 5, b
#define SLRF6                            BANKMASK(SLRCONF), 6, b
#define SLRF7                            BANKMASK(SLRCONF), 7, b
#define SOI                              BANKMASK(ADCON3), 3, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SP5                              BANKMASK(STKPTR), 5, a
#define SP6                              BANKMASK(STKPTR), 6, a
#define SPI1BMODE                        BANKMASK(SPI1CON0), 0, b
#define SPI1BUSY                         BANKMASK(SPI1CON2), 7, b
#define SPI1CKE                          BANKMASK(SPI1CON1), 6, b
#define SPI1CKP                          BANKMASK(SPI1CON1), 5, b
#define SPI1CLKSEL0                      BANKMASK(SPI1CLK), 0, b
#define SPI1CLKSEL1                      BANKMASK(SPI1CLK), 1, b
#define SPI1CLKSEL2                      BANKMASK(SPI1CLK), 2, b
#define SPI1CLKSEL3                      BANKMASK(SPI1CLK), 3, b
#define SPI1CLKSEL4                      BANKMASK(SPI1CLK), 4, b
#define SPI1CLRBF                        BANKMASK(SPI1STATUS), 2, b
#define SPI1EOSIE                        BANKMASK(SPI1INTE), 4, b
#define SPI1EOSIF                        BANKMASK(SPI1INTF), 4, b
#define SPI1FST                          BANKMASK(SPI1CON1), 4, b
#define SPI1IE                           BANKMASK(PIE3), 2, a
#define SPI1IF                           BANKMASK(PIR3), 2, a
#define SPI1IP                           BANKMASK(IPR3), 2, a
#define SPI1LSBF                         BANKMASK(SPI1CON0), 2, b
#define SPI1MD                           BANKMASK(PMD3), 4, b
#define SPI1MST                          BANKMASK(SPI1CON0), 1, b
#define SPI1RXBF                         BANKMASK(SPI1STATUS), 0, b
#define SPI1RXIE                         BANKMASK(PIE3), 0, a
#define SPI1RXIF                         BANKMASK(PIR3), 0, a
#define SPI1RXIP                         BANKMASK(IPR3), 0, a
#define SPI1RXOIE                        BANKMASK(SPI1INTE), 2, b
#define SPI1RXOIF                        BANKMASK(SPI1INTF), 2, b
#define SPI1RXR                          BANKMASK(SPI1CON2), 0, b
#define SPI1RXRE                         BANKMASK(SPI1STATUS), 3, b
#define SPI1SCKPPS0                      BANKMASK(SPI1SCKPPS), 0, b
#define SPI1SCKPPS1                      BANKMASK(SPI1SCKPPS), 1, b
#define SPI1SCKPPS2                      BANKMASK(SPI1SCKPPS), 2, b
#define SPI1SCKPPS3                      BANKMASK(SPI1SCKPPS), 3, b
#define SPI1SCKPPS4                      BANKMASK(SPI1SCKPPS), 4, b
#define SPI1SCKPPS5                      BANKMASK(SPI1SCKPPS), 5, b
#define SPI1SDIP                         BANKMASK(SPI1CON1), 1, b
#define SPI1SDIPPS0                      BANKMASK(SPI1SDIPPS), 0, b
#define SPI1SDIPPS1                      BANKMASK(SPI1SDIPPS), 1, b
#define SPI1SDIPPS2                      BANKMASK(SPI1SDIPPS), 2, b
#define SPI1SDIPPS3                      BANKMASK(SPI1SDIPPS), 3, b
#define SPI1SDIPPS4                      BANKMASK(SPI1SDIPPS), 4, b
#define SPI1SDIPPS5                      BANKMASK(SPI1SDIPPS), 5, b
#define SPI1SDOP                         BANKMASK(SPI1CON1), 0, b
#define SPI1SMP                          BANKMASK(SPI1CON1), 7, b
#define SPI1SOSIE                        BANKMASK(SPI1INTE), 5, b
#define SPI1SOSIF                        BANKMASK(SPI1INTF), 5, b
#define SPI1SPIEN                        BANKMASK(SPI1CON0), 7, b
#define SPI1SRMTIE                       BANKMASK(SPI1INTE), 7, b
#define SPI1SRMTIF                       BANKMASK(SPI1INTF), 7, b
#define SPI1SSET                         BANKMASK(SPI1CON2), 2, b
#define SPI1SSFLT                        BANKMASK(SPI1CON2), 6, b
#define SPI1SSP                          BANKMASK(SPI1CON1), 2, b
#define SPI1SSPPS0                       BANKMASK(SPI1SSPPS), 0, b
#define SPI1SSPPS1                       BANKMASK(SPI1SSPPS), 1, b
#define SPI1SSPPS2                       BANKMASK(SPI1SSPPS), 2, b
#define SPI1SSPPS3                       BANKMASK(SPI1SSPPS), 3, b
#define SPI1SSPPS4                       BANKMASK(SPI1SSPPS), 4, b
#define SPI1SSPPS5                       BANKMASK(SPI1SSPPS), 5, b
#define SPI1TCZIE                        BANKMASK(SPI1INTE), 6, b
#define SPI1TCZIF                        BANKMASK(SPI1INTF), 6, b
#define SPI1TXBE                         BANKMASK(SPI1STATUS), 5, b
#define SPI1TXIE                         BANKMASK(PIE3), 1, a
#define SPI1TXIF                         BANKMASK(PIR3), 1, a
#define SPI1TXIP                         BANKMASK(IPR3), 1, a
#define SPI1TXR                          BANKMASK(SPI1CON2), 1, b
#define SPI1TXUIE                        BANKMASK(SPI1INTE), 1, b
#define SPI1TXUIF                        BANKMASK(SPI1INTF), 1, b
#define SPI1TXWE                         BANKMASK(SPI1STATUS), 7, b
#define SPI2BMODE                        BANKMASK(SPI2CON0), 0, b
#define SPI2BUSY                         BANKMASK(SPI2CON2), 7, b
#define SPI2CKE                          BANKMASK(SPI2CON1), 6, b
#define SPI2CKP                          BANKMASK(SPI2CON1), 5, b
#define SPI2CLKSEL0                      BANKMASK(SPI2CLK), 0, b
#define SPI2CLKSEL1                      BANKMASK(SPI2CLK), 1, b
#define SPI2CLKSEL2                      BANKMASK(SPI2CLK), 2, b
#define SPI2CLKSEL3                      BANKMASK(SPI2CLK), 3, b
#define SPI2CLKSEL4                      BANKMASK(SPI2CLK), 4, b
#define SPI2CLRBF                        BANKMASK(SPI2STATUS), 2, b
#define SPI2EOSIE                        BANKMASK(SPI2INTE), 4, b
#define SPI2EOSIF                        BANKMASK(SPI2INTF), 4, b
#define SPI2FST                          BANKMASK(SPI2CON1), 4, b
#define SPI2IE                           BANKMASK(PIE11), 2, a
#define SPI2IF                           BANKMASK(PIR11), 2, a
#define SPI2IP                           BANKMASK(IPR11), 2, a
#define SPI2LSBF                         BANKMASK(SPI2CON0), 2, b
#define SPI2MD                           BANKMASK(PMD3), 5, b
#define SPI2MST                          BANKMASK(SPI2CON0), 1, b
#define SPI2RXBF                         BANKMASK(SPI2STATUS), 0, b
#define SPI2RXIE                         BANKMASK(PIE11), 0, a
#define SPI2RXIF                         BANKMASK(PIR11), 0, a
#define SPI2RXIP                         BANKMASK(IPR11), 0, a
#define SPI2RXOIE                        BANKMASK(SPI2INTE), 2, b
#define SPI2RXOIF                        BANKMASK(SPI2INTF), 2, b
#define SPI2RXR                          BANKMASK(SPI2CON2), 0, b
#define SPI2RXRE                         BANKMASK(SPI2STATUS), 3, b
#define SPI2SCKPPS0                      BANKMASK(SPI2SCKPPS), 0, b
#define SPI2SCKPPS1                      BANKMASK(SPI2SCKPPS), 1, b
#define SPI2SCKPPS2                      BANKMASK(SPI2SCKPPS), 2, b
#define SPI2SCKPPS3                      BANKMASK(SPI2SCKPPS), 3, b
#define SPI2SCKPPS4                      BANKMASK(SPI2SCKPPS), 4, b
#define SPI2SCKPPS5                      BANKMASK(SPI2SCKPPS), 5, b
#define SPI2SDIP                         BANKMASK(SPI2CON1), 1, b
#define SPI2SDIPPS0                      BANKMASK(SPI2SDIPPS), 0, b
#define SPI2SDIPPS1                      BANKMASK(SPI2SDIPPS), 1, b
#define SPI2SDIPPS2                      BANKMASK(SPI2SDIPPS), 2, b
#define SPI2SDIPPS3                      BANKMASK(SPI2SDIPPS), 3, b
#define SPI2SDIPPS4                      BANKMASK(SPI2SDIPPS), 4, b
#define SPI2SDIPPS5                      BANKMASK(SPI2SDIPPS), 5, b
#define SPI2SDOP                         BANKMASK(SPI2CON1), 0, b
#define SPI2SMP                          BANKMASK(SPI2CON1), 7, b
#define SPI2SOSIE                        BANKMASK(SPI2INTE), 5, b
#define SPI2SOSIF                        BANKMASK(SPI2INTF), 5, b
#define SPI2SPIEN                        BANKMASK(SPI2CON0), 7, b
#define SPI2SRMTIE                       BANKMASK(SPI2INTE), 7, b
#define SPI2SRMTIF                       BANKMASK(SPI2INTF), 7, b
#define SPI2SSET                         BANKMASK(SPI2CON2), 2, b
#define SPI2SSFLT                        BANKMASK(SPI2CON2), 6, b
#define SPI2SSP                          BANKMASK(SPI2CON1), 2, b
#define SPI2SSPPS0                       BANKMASK(SPI2SSPPS), 0, b
#define SPI2SSPPS1                       BANKMASK(SPI2SSPPS), 1, b
#define SPI2SSPPS2                       BANKMASK(SPI2SSPPS), 2, b
#define SPI2SSPPS3                       BANKMASK(SPI2SSPPS), 3, b
#define SPI2SSPPS4                       BANKMASK(SPI2SSPPS), 4, b
#define SPI2SSPPS5                       BANKMASK(SPI2SSPPS), 5, b
#define SPI2TCZIE                        BANKMASK(SPI2INTE), 6, b
#define SPI2TCZIF                        BANKMASK(SPI2INTF), 6, b
#define SPI2TXBE                         BANKMASK(SPI2STATUS), 5, b
#define SPI2TXIE                         BANKMASK(PIE11), 1, a
#define SPI2TXIF                         BANKMASK(PIR11), 1, a
#define SPI2TXIP                         BANKMASK(IPR11), 1, a
#define SPI2TXR                          BANKMASK(SPI2CON2), 1, b
#define SPI2TXUIE                        BANKMASK(SPI2INTE), 1, b
#define SPI2TXUIF                        BANKMASK(SPI2INTF), 1, b
#define SPI2TXWE                         BANKMASK(SPI2STATUS), 7, b
#define SPTR0                            BANKMASK(DMAnSPTRL), 0, b
#define SPTR1                            BANKMASK(DMAnSPTRL), 1, b
#define SPTR10                           BANKMASK(DMAnSPTRH), 2, b
#define SPTR11                           BANKMASK(DMAnSPTRH), 3, b
#define SPTR12                           BANKMASK(DMAnSPTRH), 4, b
#define SPTR13                           BANKMASK(DMAnSPTRH), 5, b
#define SPTR14                           BANKMASK(DMAnSPTRH), 6, b
#define SPTR15                           BANKMASK(DMAnSPTRH), 7, b
#define SPTR16                           BANKMASK(DMAnSPTRU), 0, b
#define SPTR17                           BANKMASK(DMAnSPTRU), 1, b
#define SPTR18                           BANKMASK(DMAnSPTRU), 2, b
#define SPTR19                           BANKMASK(DMAnSPTRU), 3, b
#define SPTR2                            BANKMASK(DMAnSPTRL), 2, b
#define SPTR20                           BANKMASK(DMAnSPTRU), 4, b
#define SPTR21                           BANKMASK(DMAnSPTRU), 5, b
#define SPTR3                            BANKMASK(DMAnSPTRL), 3, b
#define SPTR4                            BANKMASK(DMAnSPTRL), 4, b
#define SPTR5                            BANKMASK(DMAnSPTRL), 5, b
#define SPTR6                            BANKMASK(DMAnSPTRL), 6, b
#define SPTR7                            BANKMASK(DMAnSPTRL), 7, b
#define SPTR8                            BANKMASK(DMAnSPTRH), 0, b
#define SPTR9                            BANKMASK(DMAnSPTRH), 1, b
#define SSA0                             BANKMASK(DMAnSSAL), 0, b
#define SSA1                             BANKMASK(DMAnSSAL), 1, b
#define SSA10                            BANKMASK(DMAnSSAH), 2, b
#define SSA11                            BANKMASK(DMAnSSAH), 3, b
#define SSA12                            BANKMASK(DMAnSSAH), 4, b
#define SSA13                            BANKMASK(DMAnSSAH), 5, b
#define SSA14                            BANKMASK(DMAnSSAH), 6, b
#define SSA15                            BANKMASK(DMAnSSAH), 7, b
